[{"file_name": "n8n-nodes-base.venafitlsprotectcloud", "summary": "You would use the Venafi TLS Protect Cloud node in n8n to automate workflows that require managing TLS certificates and requests within the Venafi TLS Protect Cloud service. This node allows for operations such as creating, renewing, downloading, and deleting certificates and certificate requests, enabling integration with other applications."}, {"file_name": "n8n-nodes-base.googleperspective", "summary": "You would use the Google Perspective node when you want to automate tasks related to analyzing comments within Google Perspective and integrate its capabilities with other applications in your workflow."}, {"file_name": "n8n-nodes-base.webflow", "summary": "You would use the Webflow node in n8n to automate tasks related to Webflow, such as creating, updating, deleting, or retrieving items on a Webflow site. This node allows you to integrate Webflow with other applications, enhancing your workflow by easily managing Webflow content and operations."}, {"file_name": "n8n-nodes-base.nasa", "summary": "You would use the NASA node in n8n to automate workflows involving NASA's features, such as retrieving astronomical data, images of the day, and information on celestial objects like asteroids. It is particularly useful for users looking to integrate NASA's extensive datasets into their applications or workflows, including accessing notifications and various scientific data related to solar and interplanetary events."}, {"file_name": "n8n-nodes-base.github", "summary": "You would use the GitHub node in n8n to automate interactions with GitHub, facilitating integration between GitHub and other applications. This node supports various operations, such as creating, updating, and deleting files, issues, repositories, and releases. It's beneficial for streamlining workflows involving version control, collaboration on code projects, and managing GitHub resources efficiently."}, {"file_name": "n8n-nodes-base.npm", "summary": "You would use the npm node type in n8n to automate interactions with npm, such as retrieving package metadata, managing distribution tags, and searching for packages. This node is ideal for integrating npm with other applications within your workflows, enhancing productivity and streamlining tasks related to package management."}, {"file_name": "n8n-nodes-base.lemlist", "summary": "You would use the Lemlist node in n8n to automate and integrate tasks within Lemlist and with other applications. This node allows you to perform various operations such as managing leads (creation, deletion, updates), handling campaigns (retrieving stats and details), enriching leads and individuals with data, and managing unsubscribe lists. It is beneficial for streamlining workflows that involve email outreach, campaign tracking, and lead management."}, {"file_name": "n8n-nodes-base.awssns", "summary": "You would use the n8n AWS SNS node type to automate tasks involving AWS Simple Notification Service (SNS), allowing integration with other applications. This node is particularly useful for publishing messages to various topics in SNS, facilitating notifications and communication within your workflows."}, {"file_name": "n8n-nodes-base.mandrill", "summary": "You would use the Mandrill node in n8n when you want to automate email sending through Mandrill and integrate it with other applications in your workflows. This node allows you to send messages either using predefined templates or custom HTML, making it suitable for automating marketing, notifications, or any email communications requiring integration with other systems."}, {"file_name": "n8n-nodes-base.dropcontact", "summary": "You would use the Dropcontact node type in n8n when you need to automate tasks involving contact management, such as enriching or fetching contact information, and when you want to integrate Dropcontact's functionalities with other applications in your workflows."}, {"file_name": "n8n-nodes-base.awscertificatemanager", "summary": "You would use the AWS Certificate Manager node in n8n to automate tasks related to SSL certificate management in AWS, such as creating, deleting, retrieving, and renewing SSL certificates. This node is ideal for integrating AWS Certificate Manager into workflows that require manipulation of SSL certificates across various applications."}, {"file_name": "n8n-nodes-base.zulip", "summary": "You would use the Zulip node in n8n when you want to automate tasks within Zulip, such as sending or managing messages, manipulating streams, or handling user accounts. This node is ideal for integrating Zulip's functionalities with other applications in your workflows to enhance productivity and streamline communication."}, {"file_name": "n8n-nodes-base.ciscowebex", "summary": "You would use the Webex by Cisco node in n8n to automate workflows involving Webex services, such as creating, retrieving, updating, and deleting meetings and messages. This node is suitable for integrating Webex with other applications to enhance collaboration and streamline communication tasks within your automated processes."}, {"file_name": "n8n-nodes-base.shopify", "summary": "You would use the Shopify node type in n8n when you want to automate tasks within Shopify or integrate Shopify with other applications. This node allows for operations such as creating, updating, deleting, and retrieving both orders and products, making it ideal for users looking to streamline their eCommerce workflows."}, {"file_name": "n8n-nodes-base.circleci", "summary": "You would use the CircleCI node type in n8n to automate tasks within CircleCI and to integrate CircleCI with other applications. This node supports operations such as retrieving existing pipelines and triggering new ones, making it ideal for workflows that involve continuous integration and deployment processes."}, {"file_name": "n8n-nodes-base.trello", "summary": "You would use the Trello node type in n8n to automate tasks within Trello and integrate it with other applications. This node supports various operations like managing boards, cards, attachments, comments, and checklists, which allows for flexible automation workflows such as creating, updating, and organizing project management tasks directly in Trello."}, {"file_name": "n8n-nodes-base.storyblok", "summary": "You would use the Storyblok node type in n8n when you want to automate actions in Storyblok, such as retrieving, deleting, or publishing stories, while integrating it with other applications in your workflows. This node allows you to utilize various Storyblok features through its operations, making it suitable for enhancing content management processes."}, {"file_name": "n8n-nodes-base.amqp", "summary": "You would use the AMQP Sender node in n8n when you want to automate the process of sending messages to other applications that utilize the AMQP protocol. This node enables seamless integration and interaction between AMQP-based systems and your workflows, facilitating tasks such as sending notifications, data transfer, or triggering processes in other applications."}, {"file_name": "n8n-nodes-base.stripe", "summary": "You would use the Stripe node in n8n to automate tasks and integrate Stripe with other applications, allowing you to manage operations like getting balances, creating and updating charges, and managing customers, coupons, and payment sources within your workflows."}, {"file_name": "n8n-nodes-base.n8ntrainingcustomermessenger", "summary": "You would use the Customer Messenger (n8n Training) node specifically for the n8n new user onboarding tutorial, as it provides no additional functionality beyond that context."}, {"file_name": "n8n-nodes-base.snowflake", "summary": "You would use the Snowflake node in n8n to automate tasks involving Snowflake, such as executing SQL queries, inserting rows into a database, and updating database records. This node is ideal for integrating Snowflake with other applications and streamlining workflows that require interaction with Snowflake's data management capabilities."}, {"file_name": "n8n-nodes-base.microsoftoutlook", "summary": "You would use the Microsoft Outlook node in n8n to automate tasks within Microsoft Outlook, such as creating, updating, deleting, and retrieving emails, contacts, calendars, drafts, folders, and their messages. This node allows for seamless integration with other applications, enhancing workflow efficiency by managing Outlook features programmatically."}, {"file_name": "n8n-nodes-base.demio", "summary": "The Demio node in n8n is used to automate tasks within Demio and to integrate it with other applications. You would use this node type when you need to manage events, such as retrieving event details, registering participants, or obtaining reports about events in Demio. It's particularly useful for users looking to enhance their workflow by connecting Demio's functionalities with other tools and streamline their event management processes."}, {"file_name": "n8n-nodes-base.awsdynamodb", "summary": "You would use the AWS DynamoDB node when you need to automate tasks within AWS DynamoDB or integrate its functionalities with other applications. This node enables you to perform operations such as creating, reading, updating, and deleting records in DynamoDB, making it a key component for workflows that require interaction with AWS's database service."}, {"file_name": "n8n-nodes-base.bamboohr", "summary": "You would use the BambooHR node in n8n to automate tasks related to human resources management, such as managing employee records, generating company reports, and handling employee documents and files. This node is beneficial for integrating BambooHR with other applications to streamline HR processes and improve efficiency in managing HR workflows."}, {"file_name": "n8n-nodes-base.zohocrm", "summary": "You would use the Zoho CRM node type in n8n when you want to automate tasks within Zoho CRM or integrate it with other applications. This node allows you to perform a wide range of operations related to accounts, contacts, deals, invoices, leads, products, purchase orders, quotes, sales orders, and vendors, including creating, updating, deleting, and retrieving records."}, {"file_name": "n8n-nodes-base.googledocs", "summary": "You would use the Google Docs node in n8n to automate tasks within Google Docs, such as creating, updating, and retrieving documents. This node is beneficial for integrating Google Docs with other applications and streamlining workflow automation involving document management."}, {"file_name": "n8n-nodes-base.telegram", "summary": "You would use the Telegram node in n8n when you want to automate tasks within the Telegram platform, such as managing chats, sending messages (like text, photos, or files), and handling callback queries. This node facilitates integration with other applications, enabling a seamless workflow that includes sending or receiving messages, updating chat information, and managing file interactions. It's particularly useful for developers and businesses looking to enhance engagement through automated responses and notifications in Telegram."}, {"file_name": "n8n-nodes-base.youtube", "summary": "You would use the YouTube node in n8n to automate tasks involving YouTube, such as managing channels, playlists, and videos. This includes operations like retrieving, updating, creating, or deleting channels and playlists, as well as uploading and managing videos. It allows for seamless integration of YouTube functionalities within other workflows and applications."}, {"file_name": "n8n-nodes-base.strapi", "summary": "You would use the Strapi node in n8n to automate tasks within Strapi, such as creating, updating, deleting, or retrieving entries, and to integrate Strapi with other applications in your workflows."}, {"file_name": "n8n-nodes-base.stackby", "summary": "You would use the Stackby node in n8n to automate tasks within Stackby and to integrate it with other applications. This node allows for various operations such as appending, deleting, listing, and reading data in Stackby, making it useful for users who need to streamline their workflow and manage data across different platforms."}, {"file_name": "n8n-nodes-base.discourse", "summary": "You would use the Discourse node type in n8n to automate tasks and integrate Discourse with other applications. It allows you to manage various aspects of a Discourse forum, including creating, retrieving, updating, and deleting categories, groups, posts, and users. This node is useful for workflows that require interaction with Discourse features or for automating user management and content updates within Discourse."}, {"file_name": "n8n-nodes-base.onfleet", "summary": "You would use the Onfleet node type in n8n to automate and integrate various Onfleet operations within your workflows. This includes managing tasks, admins, recipients, teams, hubs, workers, and organizations by creating, updating, deleting, or retrieving their information. If you're looking to streamline logistics and task management processes by connecting Onfleet with other applications, the Onfleet node is essential for executing these tasks effectively."}, {"file_name": "n8n-nodes-base.reddit", "summary": "The Reddit node in n8n is used to automate tasks and integrate Reddit with other applications. This node enables users to submit, retrieve, and delete posts; manage comments; and access user and subreddit information. It is ideal for workflows that require interaction with Reddit's features, such as posting content or gathering insights from subreddit activities."}, {"file_name": "n8n-nodes-base.zendesk", "summary": "You would use the Zendesk node in n8n to automate and integrate various Zendesk functionalities into your workflows. It allows you to manage tickets, users, and organizations by creating, retrieving, updating, and deleting them. This node is ideal for enhancing customer support processes and integrating Zendesk with other applications to streamline operations."}, {"file_name": "n8n-nodes-base.awsrekognition", "summary": "You would use the AWS Rekognition node in n8n to automate tasks that involve analyzing images through AWS Rekognition. This node allows you to integrate image analysis capabilities into your workflows efficiently, enabling interaction between AWS Rekognition and other applications."}, {"file_name": "n8n-nodes-base.baserow", "summary": "You would use the Baserow node in n8n to automate tasks and integrate Baserow with other applications. This node allows you to perform various operations such as creating, retrieving, updating, and deleting rows in Baserow, making it ideal for workflows that require data management within Baserow."}, {"file_name": "n8n-nodes-base.zammad", "summary": "You would use the Zammad node in n8n when you want to automate tasks in Zammad and integrate it with other applications. This node supports various operations, including managing groups, organizations, tickets, and users, enabling users to automate workflows that involve creating, retrieving, updating, or deleting these elements in Zammad."}, {"file_name": "n8n-nodes-base.cockpit", "summary": "The Cockpit node in n8n is used when you want to automate tasks within the Cockpit application or integrate it with other services. You would use this node type to manage collections by creating, updating, or retrieving entries, store data from form submissions, and access singletons. It is particularly beneficial for streamlining workflows involving data management and facilitates the connection between Cockpit and various applications."}, {"file_name": "n8n-nodes-base.homeassistant", "summary": "You would use the Home Assistant node type when you want to automate tasks within Home Assistant or integrate it with other applications. This node allows you to utilize various Home Assistant features such as managing camera proxies, handling configurations, accessing logs, executing services, and managing states. It streamlines workflows that require interaction with Home Assistant's capabilities, enabling automation for tasks like capturing camera screenshots, checking configurations, and more."}, {"file_name": "n8n-nodes-base.postgres", "summary": "The Postgres node in n8n is used to automate and integrate operations with Postgres databases. You would use this node type when you need to execute SQL queries, manage data by inserting, updating, selecting, or deleting rows from a table, or when you want to integrate Postgres functionalities into your workflows with other applications. It simplifies database interactions by providing various operations and supports complex queries while ensuring proper database management and interaction."}, {"file_name": "n8n-nodes-base.awstextract", "summary": "You would use the AWS Textract node type when you need to automate the processing of documents through AWS Textract, particularly for extracting data from receipts or invoices. This node allows integration of AWS Textract's capabilities into your workflows, enabling seamless interaction with other applications."}, {"file_name": "n8n-nodes-base.asana", "summary": "You would use the Asana node in n8n to automate tasks and manage workflows involving Asana. This includes creating, updating, deleting, and retrieving information related to users, tasks, projects, and subtasks, allowing integration with other applications and streamlining project management processes. It is especially useful for enhancing productivity and collaboration within teams."}, {"file_name": "n8n-nodes-base.intercom", "summary": "You would use the Intercom node type in n8n to automate tasks within Intercom and to connect Intercom with other applications in your workflows. It supports various operations such as creating, updating, deleting, and retrieving data related to companies, leads, and users in Intercom, making it ideal for managing customer communications and data integration."}, {"file_name": "n8n-nodes-base.googlecalendar", "summary": "You would use the Google Calendar node in n8n to automate tasks related to Google Calendar, such as adding, retrieving, updating, or deleting calendar events. This node is ideal for integrating Google Calendar with other applications or services, enhancing workflow efficiency by managing calendar events programmatically."}, {"file_name": "n8n-nodes-base.seatable", "summary": "You would use the SeaTable node in n8n to automate workflows that involve managing data within SeaTable. This node allows you to create, update, delete, and retrieve rows from SeaTable, making it ideal for integrating SeaTable processes with other applications and streamlining data management."}, {"file_name": "n8n-nodes-base.azurestorage", "summary": "The Azure Storage node is used when you want to automate tasks or integrate Azure Storage services within your workflows in n8n. It provides various operations for managing blobs and containers, such as creating, retrieving, and deleting them, making it ideal for handling data storage and retrieval tasks in automated processes."}, {"file_name": "n8n-nodes-base.googleanalytics", "summary": "You would use the Google Analytics node in n8n to automate tasks related to Google Analytics and to integrate its functionalities with other applications. This node is particularly useful for retrieving reports and user activity data, enabling seamless data management and analysis workflows."}, {"file_name": "n8n-nodes-base.mautic", "summary": "You would use the Mautic node when you want to automate tasks within Mautic or integrate Mautic with other applications. This includes managing companies and contacts, such as creating, updating, deleting records, and handling campaign interactions like adding or removing contacts from campaigns and segments."}, {"file_name": "n8n-nodes-base.clockify", "summary": "You would use the Clockify node in n8n when you want to automate tasks related to time tracking and project management within the Clockify platform. This node allows you to create, update, retrieve, and delete projects, tasks, tags, and time entries, enabling integration with other applications and enhancing workflow efficiency."}, {"file_name": "n8n-nodes-base.twilio", "summary": "You would use the Twilio node type in n8n to automate tasks within the Twilio platform, allowing you to integrate Twilio with other applications. It's ideal for sending SMS, MMS, or WhatsApp messages and for making phone calls with text-to-speech features. This node is useful for businesses or users looking to enhance their communication workflows by automating messaging and call functionalities."}, {"file_name": "n8n-nodes-base.zoom", "summary": "You would use the Zoom node in n8n to automate tasks related to Zoom, such as creating, retrieving, updating, and deleting meetings. This node is ideal for integrating Zoom with other applications and streamlining workflows involving video conferencing and meetings."}, {"file_name": "n8n-nodes-base.woocommerce", "summary": "You would use the WooCommerce node when you need to automate tasks related to WooCommerce, such as managing customers, orders, and products. It allows for integration with other applications and supports a variety of operations including creating, deleting, retrieving, and updating customers, orders, and products."}, {"file_name": "n8n-nodes-base.supabase", "summary": "You would use the Supabase node in n8n to automate tasks within Supabase and to integrate it with other applications. It is particularly useful when you need to perform operations such as creating, deleting, updating, or retrieving rows from a Supabase database, streamlining workflows that involve database interactions."}, {"file_name": "n8n-nodes-base.phantombuster", "summary": "You would use the PhantomBuster node in n8n to automate tasks within the PhantomBuster platform and to integrate its functionalities with other applications. This node allows you to manage agents by adding them to the launch queue, retrieving their details and outputs, and deleting them when necessary. It is particularly useful for automating workflows that require web scraping or data extraction, leveraging PhantomBuster's capabilities."}, {"file_name": "n8n-nodes-base.gotowebinar", "summary": "You would use the GoToWebinar node in n8n to automate and integrate various operations related to webinars, such as managing attendees, co-organizers, panelists, registrants, sessions, and webinars themselves. This node allows you to streamline tasks like creating or deleting participants and retrieving details of sessions, thereby enhancing productivity and improving efficiency in managing webinars."}, {"file_name": "n8n-nodes-base.pipedrive", "summary": "You would use the Pipedrive node in n8n to automate workflows involving Pipedrive by leveraging its capabilities to manage activities, deals, leads, notes, organizations, and products. This node is ideal for integrating Pipedrive with other applications and streamlining CRM tasks such as creating, updating, and deleting records, or retrieving data associated with various entities in Pipedrive."}, {"file_name": "n8n-nodes-base.microsoftsql", "summary": "Use the Microsoft SQL node in n8n when you need to automate tasks related to Microsoft SQL databases, such as executing SQL queries, or performing create, read, update, and delete (CRUD) operations. This node is useful for integrating Microsoft SQL with other applications in your workflows."}, {"file_name": "n8n-nodes-base.googlecloudrealtimedatabase", "summary": "You would use the Google Cloud Realtime Database node in n8n to automate tasks involving the Google Cloud Realtime Database, such as writing, deleting, retrieving, and updating data. This node is particularly useful for integrating Google Cloud Realtime Database functionalities into broader workflows with multiple applications, enabling seamless data management and operations."}, {"file_name": "n8n-nodes-base.airtable", "summary": "You would use the Airtable node in n8n to automate tasks related to Airtable and integrate it with other applications. This node allows for a variety of operations such as creating, reading, updating, deleting, and listing data within Airtable tables. It is particularly useful for workflows that require collaboration or data management across different applications, enabling seamless interaction with Airtable's features."}, {"file_name": "n8n-nodes-base.copper", "summary": "You would use the Copper node in n8n to automate tasks and integrate workflows involving Copper, a customer relationship management (CRM) tool. This node supports various operations such as creating, updating, retrieving, and deleting entities like companies, leads, projects, and tasks within Copper, allowing you to seamlessly connect it with other applications in your workflows."}, {"file_name": "n8n-nodes-base.unleashedsoftware", "summary": "You would use the Unleashed Software node in n8n when you want to automate tasks within Unleashed Software or integrate it with other applications. This node allows you to access and manipulate features such as retrieving sales orders and managing stock levels, streamlining your workflows."}, {"file_name": "n8n-nodes-base.okta", "summary": "You would use the Okta node type in n8n to automate tasks related to user management within Okta and to integrate Okta functionalities with other applications. It supports operations such as creating, updating, and deleting users, making it useful for workflows that involve user data handling in Okta."}, {"file_name": "n8n-nodes-base.splunk", "summary": "You would use the Splunk node in n8n to automate tasks and integrate Splunk with other applications. This node allows you to manage alerts, search configurations, search jobs, search results, and user accounts within Splunk. It is beneficial when you need to handle events or data in Splunk programmatically, such as retrieving alerts, managing search jobs and configurations, or modifying user accounts."}, {"file_name": "n8n-nodes-base.activecampaign", "summary": "You would use the ActiveCampaign node type in n8n to automate tasks and integrate ActiveCampaign with other applications. This node supports various operations such as creating, retrieving, updating, and deleting accounts, contacts, deals, and orders. It is useful for managing marketing workflows, handling contacts, and optimizing e-commerce processes directly within your automated workflows."}, {"file_name": "n8n-nodes-base.filemaker", "summary": "You would use the FileMaker node in n8n to automate tasks within the FileMaker application and integrate it with other services. This node allows you to perform operations such as finding, creating, editing, duplicating, and deleting records, as well as executing scripts, making it ideal for enhancing workflow efficiency and connectivity between FileMaker and different applications."}, {"file_name": "n8n-nodes-base.googlebigquery", "summary": "You would use the Google BigQuery node type when you need to automate tasks within Google BigQuery and integrate its functionalities with other applications. This node allows you to execute queries and insert records, making it ideal for workflows that require data manipulation or retrieval from Google BigQuery."}, {"file_name": "n8n-nodes-base.whatsapp", "summary": "You would use the WhatsApp Business Cloud node in n8n to automate tasks and integrate WhatsApp Business with other applications. This node supports operations such as sending messages, sending message templates, and managing media (uploading, downloading, and deleting). It is useful for enhancing workflow automation on WhatsApp and connecting it with various other services."}, {"file_name": "n8n-nodes-base.beeminder", "summary": "You would use the Beeminder node type in n8n to automate tasks related to Beeminder, such as creating, deleting, or updating data points for specific goals. It allows you to integrate Beeminder's functionality with other applications, enhancing your workflow and task management."}, {"file_name": "n8n-nodes-base.n8ntrainingcustomerdatastore", "summary": "You would use the Customer Datastore (n8n Training) node when participating in the n8n new user onboarding tutorial, as it is specifically designed to provide dummy data for testing purposes within that context. It does not offer any additional functionality beyond this."}, {"file_name": "n8n-nodes-base.elasticsearch", "summary": "Use the Elasticsearch node when you need to automate tasks in Elasticsearch and integrate it with other applications. This node supports various operations such as creating, updating, deleting, and retrieving documents and indexes, making it useful for managing data within Elasticsearch as part of your workflows."}, {"file_name": "n8n-nodes-base.rocketchat", "summary": "You would use the Rocket.Chat node type in n8n to automate tasks within Rocket.Chat and integrate it with other applications. This node allows you to post messages to channels and send direct messages, facilitating effective communication and workflow automation."}, {"file_name": "n8n-nodes-base.quickbase", "summary": "You would use the Quick Base node in n8n when you want to automate tasks within Quick Base and integrate its functionalities with other applications. This node allows you to perform various operations such as creating, updating, deleting, and retrieving records, as well as managing fields and files, making it a versatile tool for enhancing your workflows with Quick Base."}, {"file_name": "n8n-nodes-base.awstranscribe", "summary": "You would use the AWS Transcribe node in n8n when you need to automate transcription tasks within AWS Transcribe and integrate these tasks with other applications. This includes operations such as creating, deleting, and retrieving transcription jobs, which helps streamline workflows involving audio or video transcription."}, {"file_name": "n8n-nodes-base.posthog", "summary": "You would use the PostHog node type when you want to automate tasks within PostHog and integrate it with other applications in your workflows. This node allows you to create aliases, track events, manage identity, and track pages or screens, enabling efficient data management and user interaction tracking."}, {"file_name": "n8n-nodes-base.thehive", "summary": "You would use the TheHive node in n8n to automate processes within TheHive and integrate it with other applications. This node allows you to leverage built-in features of TheHive, such as creating alerts, managing cases, counting logs, and handling observables and tasks. It's specifically for users of TheHive's API versions 3 and 4, enabling seamless task automation and workflow integration."}, {"file_name": "n8n-nodes-base.grafana", "summary": "You would use the Grafana node in n8n when you need to automate tasks within Grafana and integrate it with other applications. This node allows you to perform various operations such as creating, updating, deleting, and retrieving dashboards, teams, and users in Grafana. It's particularly useful for users looking to streamline their workflow by connecting Grafana's functionalities to other services."}, {"file_name": "n8n-nodes-base.freshworkscrm", "summary": "You would use the Freshworks CRM node type in n8n to automate and integrate tasks within Freshworks CRM, such as managing accounts, appointments, contacts, deals, notes, and sales activities. This node allows you to create, update, delete, and retrieve different types of data within the CRM, making it suitable for workflows that require interaction with Freshworks CRM services."}, {"file_name": "n8n-nodes-base.awselb", "summary": "You would use the AWS Elastic Load Balancing node in n8n when you want to automate and manage AWS Elastic Load Balancers (ELB) within your workflows. This node allows you to perform various operations such as creating, deleting, and retrieving load balancers and managing listener certificates. It is ideal for integrating AWS ELB functionalities with other applications to streamline operations related to load balancing."}, {"file_name": "n8n-nodes-base.marketstack", "summary": "You would use the marketstack node type in n8n to automate tasks related to marketstack, such as retrieving market data, including end-of-day data, exchange information, and ticker details. This integration allows you to streamline workflows by connecting marketstack functionality with other applications."}, {"file_name": "n8n-nodes-base.elasticsecurity", "summary": "You would use the Elastic Security node type in n8n when you need to automate tasks within Elastic Security, such as managing cases (creating, updating, deleting, retrieving), adding comments or tags to cases, and integrating Elastic Security with other applications in your workflows."}, {"file_name": "n8n-nodes-base.notion", "summary": "You would use the Notion node in n8n to automate tasks within Notion and to connect Notion with other applications. This node allows you to perform various operations such as managing databases, creating or updating pages, and retrieving user information, making it ideal for integrating Notion functionalities into your workflows."}, {"file_name": "n8n-nodes-base.bitwarden", "summary": "You would use the Bitwarden node in n8n to automate tasks related to Bitwarden, such as managing collections, events, groups, and members within the Bitwarden application. This node is ideal for integrating Bitwarden's functionalities into workflows, allowing users to perform actions like creating, updating, and deleting entities in Bitwarden, thereby enhancing productivity and collaboration with other applications."}, {"file_name": "n8n-nodes-base.quickchart", "summary": "You would use the QuickChart node when you want to automate chart generation using QuickChart and integrate it with other applications within n8n workflows. This node supports multiple chart types like bar, doughnut, line, pie, and polar charts, making it suitable for visualizing data in various formats."}, {"file_name": "n8n-nodes-base.line", "summary": "The Line node in n8n is used to automate tasks within the Line messaging platform and to integrate it with other applications. You would use this node type to send notifications to users or groups through Line, facilitating communication and workflow automation. However, it's important to note that the Line node is deprecated due to the discontinuation of LINE Notify service effective April 1st, 2025."}, {"file_name": "n8n-nodes-base.pushbullet", "summary": "You would use the Pushbullet node type in n8n when you want to automate interactions with Pushbullet, allowing you to create, update, delete, or retrieve pushes as part of your workflows. This node is useful for integrating Pushbullet functionality with other applications to streamline notifications and workflow automation."}, {"file_name": "n8n-nodes-base.philipshue", "summary": "You would use the Philips Hue node in n8n when you want to automate tasks related to your Philips Hue lighting system, such as managing lights (deleting, retrieving, and updating) and integrating Philips Hue functionality with other applications within your workflows."}, {"file_name": "n8n-nodes-base.brandfetch", "summary": "You would use the Brandfetch node type in n8n when you want to automate tasks related to brand information retrieval and integration with other applications. This node allows you to access various brand attributes such as company colors, data, fonts, industry, logos, and icons, enabling you to streamline processes that require brand details."}, {"file_name": "n8n-nodes-base.thehive5", "summary": "You would use the TheHive 5 node in n8n to automate tasks related to TheHive, leverage its API for version 5, and integrate TheHive's functionalities with other applications. This node allows you to manage alerts, cases, comments, observables, tasks, and their logs efficiently by creating, updating, deleting, and searching for them, thereby enhancing workflow automation within your projects."}, {"file_name": "n8n-nodes-base.messagebird", "summary": "You would use the MessageBird node type in n8n to automate workflows that involve sending SMS messages or checking account balances within MessageBird. This node is beneficial for integrating MessageBird with other applications, allowing seamless communication and automation."}, {"file_name": "n8n-nodes-base.gsuiteadmin", "summary": "You would use the Google Workspace Admin node in n8n to automate tasks and manage user and group information within Google Workspace Admin. This node allows you to perform operations such as creating, updating, deleting, and retrieving users and groups, making it ideal for integrating Google Workspace functionalities into your workflows."}, {"file_name": "n8n-nodes-base.mocean", "summary": "You would use the Mocean node type in n8n to automate tasks involving Mocean services, such as sending SMS and voice messages. This node allows for seamless integration of Mocean's functionalities with other applications in your workflows."}, {"file_name": "n8n-nodes-base.facebookgraphapi", "summary": "You would use the Facebook Graph API node in n8n to automate and integrate tasks related to Facebook's Graph API within your workflows. This node allows you to perform operations such as GET, POST, and DELETE requests to manage various aspects of Facebook data, including video uploads and interactions with pages and feeds. It is particularly useful when you need to connect Facebook functionalities with other applications in your automation processes."}, {"file_name": "n8n-nodes-base.microsoftexcel", "summary": "You would use the Microsoft Excel node in n8n to automate tasks and integrate Microsoft Excel with other applications within your workflows. This node facilitates operations such as adding and retrieving data from tables, managing workbooks and worksheets, and enabling efficient data manipulation in Microsoft Excel, making it ideal for scenarios that require automatic handling and synchronization of Excel data."}, {"file_name": "n8n-nodes-base.mailjet", "summary": "You would use the Mailjet node when you want to automate tasks related to sending emails and SMS messages through Mailjet, or when you need to integrate Mailjet functionalities into other applications or workflows within n8n."}, {"file_name": "n8n-nodes-base.timescaledb", "summary": "You would use the TimescaleDB node in n8n to automate tasks within a TimescaleDB database, enabling integration with various applications. This node supports executing SQL queries and managing data operations such as inserting and updating rows, making it useful for workflow automation that requires database interactions."}, {"file_name": "n8n-nodes-base.gong", "summary": "You would use the Gong node type in n8n to automate tasks within Gong and to connect Gong with other applications. This node enables you to perform various operations such as retrieving call and user data seamlessly, making it ideal for integrations that require the usage of Gong's functionalities in workflows."}, {"file_name": "n8n-nodes-base.box", "summary": "You would use the Box node type in n8n when you want to automate tasks or integrate workflows involving Box, such as managing files and folders. This includes operations like creating, uploading, deleting, sharing, and searching for files and folders within Box, facilitating seamless interactions between Box and other applications."}, {"file_name": "n8n-nodes-base.googlecloudnaturallanguage", "summary": "You would use the Google Cloud Natural Language node type in n8n when you want to automate tasks related to natural language processing, such as analyzing the sentiment of documents. This node integrates Google Cloud Natural Language services with other applications, facilitating workflows that require text analysis."}, {"file_name": "n8n-nodes-base.awslambda", "summary": "You would use the AWS Lambda node in n8n when you want to automate tasks and integrate AWS Lambda functions with other applications in your workflows. This node allows you to invoke AWS Lambda functions, making it suitable for automating backend processes or executing serverless functions as part of a larger orchestration in n8n."}, {"file_name": "n8n-nodes-base.rabbitmq", "summary": "You would use the RabbitMQ node in n8n to automate tasks involving RabbitMQ by sending or managing messages between applications, allowing for efficient integration and workflow automation."}, {"file_name": "n8n-nodes-base.keap", "summary": "You would use the Keap node type in n8n to automate and streamline tasks within the Keap platform, such as managing companies, contacts, and ecommerce transactions. This node integrates various Keap features into your workflows, allowing for operations like creating or updating contacts, managing orders and products, sending emails, and handling files. It facilitates seamless interaction between Keap and other applications, making it useful for businesses looking to improve their customer relationship management and ecommerce processes."}, {"file_name": "n8n-nodes-base.bubble", "summary": "You would use the Bubble node in n8n when you want to automate tasks within the Bubble application or integrate Bubble with other applications. This node supports various operations such as creating, deleting, retrieving, and updating objects, making it a versatile choice for managing data and workflows involving Bubble."}, {"file_name": "n8n-nodes-base.oura", "summary": "You would use the Oura node in n8n to automate interactions with the Oura platform, allowing you to integrate and utilize Oura's features such as retrieving user profiles and various activity summaries (activity, readiness, sleep) within your workflows. This is useful for automating health and fitness tracking data and connecting it with other applications."}, {"file_name": "n8n-nodes-base.rundeck", "summary": "You would use the Rundeck node when you want to automate tasks within Rundeck and integrate its job execution capabilities with other applications in your workflows. This node allows you to execute jobs and retrieve job metadata, making it essential for enhancing operational efficiency and workflow automation."}, {"file_name": "n8n-nodes-base.clearbit", "summary": "You would use the Clearbit node when you want to automate interactions with Clearbit's services, such as retrieving company information, logo, and domain based on names or emails. It is particularly useful for integrating Clearbit into your workflows for tasks like lead generation or enriching customer data."}, {"file_name": "n8n-nodes-base.halopsa", "summary": "You would use the HaloPSA node type in n8n to automate tasks and integrate HaloPSA with other applications, such as managing clients, sites, tickets, and users efficiently. This node allows you to create, update, delete, and retrieve data related to these entities, thus streamlining operations within HaloPSA workflows."}, {"file_name": "n8n-nodes-base.freshdesk", "summary": "You would use the Freshdesk node type in n8n when you want to automate tasks within Freshdesk, such as managing contacts and tickets. It allows for operations like creating, updating, deleting, and retrieving contacts and tickets, facilitating integration with other applications and enhancing workflow efficiency."}, {"file_name": "n8n-nodes-base.twist", "summary": "You would use the Twist node type in n8n to automate workflows related to the Twist application, enabling integration with other apps. This node supports a variety of operations, including managing channels (creation, deletion, updating), commenting (adding, deleting, updating comments on threads), and handling message conversations and threads, making it ideal for teams looking to streamline communications and task management within Twist."}, {"file_name": "n8n-nodes-base.mongodb", "summary": "You would use the MongoDB node in n8n to automate interactions with a MongoDB database and to integrate MongoDB functionalities within your workflows with ease. This node allows you to perform various operations such as aggregating, inserting, updating, deleting, and finding documents, making it ideal for tasks that require database manipulation or data retrieval and coordination between MongoDB and other applications."}, {"file_name": "n8n-nodes-base.xero", "summary": "You would use the Xero node type in n8n to automate tasks within Xero and to integrate Xero with other applications. This node supports operations such as creating, updating, and retrieving contacts and invoices, allowing you to streamline your workflow regarding Xero's accounting features."}, {"file_name": "n8n-nodes-base.spontit", "summary": "You would use the Spontit node in n8n when you want to automate tasks within Spontit, particularly for creating push notifications, and also when integrating Spontit with other applications in your workflows."}, {"file_name": "n8n-nodes-base.misp", "summary": "Use the MISP node in n8n to automate and integrate MISP (Malware Information Sharing Platform) functionalities into your workflows. This node is ideal for tasks such as creating, updating, and deleting events, attributes, organizations, and managing feeds. It supports various operations like searching and publishing events, making it suitable for enhancing collaboration and data sharing in cybersecurity contexts."}, {"file_name": "n8n-nodes-base.flow", "summary": "You would use the Flow node type in n8n to automate tasks and integrate the Flow application with other workflows, enabling operations such as creating, updating, and retrieving tasks. It is particularly useful for those needing seamless task management within various automation scenarios."}, {"file_name": "n8n-nodes-base.lonescale", "summary": "Use the LoneScale node in n8n to automate tasks and integrate LoneScale with other applications. It's particularly useful for managing Lists and Items within LoneScale, enabling you to create new entries seamlessly as part of your workflows."}, {"file_name": "n8n-nodes-base.microsofttodo", "summary": "You would use the Microsoft To Do node in n8n to automate tasks and manage your workflows within Microsoft To Do by integrating it with other applications. This node allows you to create, update, delete, and retrieve linked resources, lists, and tasks, enabling seamless operation across your productivity tools."}, {"file_name": "n8n-nodes-base.taiga", "summary": "You would use the Taiga node type in n8n to automate tasks and integrate Taiga with other applications. It allows users to manage issues by creating, updating, deleting, and retrieving them, providing seamless connectivity between Taiga and other tools within your workflows."}, {"file_name": "n8n-nodes-base.sendgrid", "summary": "You would use the SendGrid node type in n8n when you want to automate operations related to email communications, such as sending emails, managing contacts, and organizing email lists. This node enables seamless integration between SendGrid and other applications, allowing tasks like creating, updating, and deleting contacts and lists, which can enhance your workflows involving email marketing or notifications."}, {"file_name": "n8n-nodes-base.signl4", "summary": "The SIGNL4 node is used when you want to automate tasks and integrate the SIGNL4 alerting system with other applications within your n8n workflows. This node allows you to send alerts and resolve them, enabling seamless communication and incident management across various platforms."}, {"file_name": "n8n-nodes-base.mqtt", "summary": "You would use the MQTT node type in n8n to automate tasks that involve the MQTT protocol, allowing you to send messages and integrate MQTT with other applications. This node is ideal for workflows that require message transport via MQTT, supporting operations like setting message topics and incorporating input data into messages. It's particularly useful for integrating IoT devices or applications that rely on MQTT for communication."}, {"file_name": "n8n-nodes-base.openweathermap", "summary": "You would use the OpenWeatherMap node in n8n when you need to automate work involving weather data, such as retrieving current weather information or forecasts for the next five days, and when you want to integrate this weather data with other applications and workflows."}, {"file_name": "n8n-nodes-base.wekan", "summary": "You would use the Wekan node in n8n to automate and integrate tasks within Wekan into your workflows. This node allows you to perform various operations such as creating, updating, deleting, and fetching both boards and cards, along with managing comments, checklists, and lists associated with those boards and cards. It is particularly useful for any automation that requires interaction with Wekan's features, enhancing productivity by connecting it with other applications."}, {"file_name": "n8n-nodes-base.kitemaker", "summary": "You would use the Kitemaker node type in n8n when you need to automate workflows in Kitemaker and connect it with other applications. This node is beneficial for operations such as retrieving organizational data, managing spaces and users, and creating or updating work items in Kitemaker."}, {"file_name": "n8n-nodes-base.s3", "summary": "You would use the S3 node in n8n when you need to automate actions related to non-AWS S3 storage solutions, such as MinIO, Wasabi, or Digital Ocean Spaces. This node allows you to perform various operations, including managing buckets and files, such as creating, deleting, downloading, and uploading them, thereby facilitating integration of S3 functionalities into your workflows."}, {"file_name": "n8n-nodes-base.emelia", "summary": "You would use the Emelia node in n8n to automate tasks related to Emelia, such as creating marketing campaigns and managing contact lists. This node is ideal for integrating Emelia's features with other applications, streamlining workflows, and enhancing marketing automation efforts."}, {"file_name": "n8n-nodes-base.microsoftdynamicscrm", "summary": "You would use the Microsoft Dynamics CRM node type in n8n to automate tasks within Microsoft Dynamics CRM and to facilitate the integration of Microsoft Dynamics CRM with other applications. This node allows you to perform essential operations such as creating, updating, deleting, and retrieving accounts in Microsoft Dynamics CRM, thus streamlining your workflows by connecting CRM functionalities with other tools and services."}, {"file_name": "n8n-nodes-base.pagerduty", "summary": "You would use the PagerDuty node in n8n to automate interactions with PagerDuty services, such as creating and managing incidents, retrieving incident notes, and accessing log entries and user information. This node is particularly useful for integrating PagerDuty functionality into broader workflows involving other applications, allowing for streamlined incident management and collaboration."}, {"file_name": "n8n-nodes-base.openthesaurus", "summary": "You would use the OpenThesaurus node type in n8n when you want to automate processes that involve finding synonyms for German words. This node allows seamless integration of synonym look-up functionality into your workflows without the need for authentication, making it a useful tool for language-related applications or when enhancing text content in German."}, {"file_name": "n8n-nodes-base.coda", "summary": "You would use the Coda node in n8n to automate tasks and integrate Coda with other applications. It allows you to manage various Coda features including creating, updating, and deleting controls, formulas, tables, and views, making it useful for workflows that require interaction with Coda data."}, {"file_name": "n8n-nodes-base.drift", "summary": "You would use the Drift node in n8n to automate interactions within the Drift platform and to integrate Drift's functionality with other applications. This node is ideal for processes that involve managing contacts in Drift, such as creating, updating, retrieving, and deleting contact information, thus streamlining your customer engagement workflows."}, {"file_name": "n8n-nodes-base.quickbooks", "summary": "You would use the QuickBooks Online node type in n8n to automate various tasks and integrate QuickBooks Online with other applications. This node supports operations such as creating, updating, deleting, and retrieving bills, customers, employees, estimates, invoices, payments, and vendors, making it ideal for streamlining accounting processes and enhancing workflow efficiency."}, {"file_name": "n8n-nodes-base.googlesheets", "summary": "You would use the Google Sheets node in n8n to automate tasks and integrate workflows with Google Sheets. This node allows you to create, update, delete, append, and retrieve data from spreadsheets and sheets, making it ideal for scenarios where you need to handle data management in Google Sheets efficiently, such as syncing data between applications, generating reports, or processing form submissions."}, {"file_name": "n8n-nodes-base.googlecontacts", "summary": "You would use the Google Contacts node type in n8n to automate tasks and streamline workflows involving Google Contacts. This node is useful for integrating Google Contacts with other applications, allowing for actions such as creating, updating, retrieving, or deleting contacts seamlessly within your automated processes."}, {"file_name": "n8n-nodes-base.microsoftteams", "summary": "You would use the Microsoft Teams node type in n8n when you want to automate tasks and integrate Microsoft Teams with other applications. This node allows you to perform various operations including creating, deleting, updating, and retrieving channels, messages, and tasks within Microsoft Teams, thereby streamlining your workflow and enhancing collaboration."}, {"file_name": "n8n-nodes-base.hubspot", "summary": "Use the HubSpot node type in n8n when you want to automate tasks and workflows involving HubSpot. This node allows you to create, update, delete, and retrieve information related to contacts, deals, companies, engagements, and tickets. Perfect for integrating HubSpot with other applications, it supports a variety of operations for managing marketing and sales activities effectively."}, {"file_name": "n8n-nodes-base.pushcut", "summary": "You would use the Pushcut node when you want to automate notifications through Pushcut or integrate it with other applications in your workflows. This node allows for seamless communication and enhances automation capabilities by sending notifications directly via Pushcut."}, {"file_name": "n8n-nodes-base.odoo", "summary": "You would use the Odoo node type in n8n to automate workflows within Odoo and to integrate Odoo with other applications. It supports a variety of operations related to managing contacts, opportunities, notes, and custom resources, allowing users to create, read, update, and delete these entities efficiently."}, {"file_name": "n8n-nodes-base.linkedin", "summary": "You would use the LinkedIn node type in n8n to automate tasks related to LinkedIn, such as creating posts, and to integrate LinkedIn with other applications. This node allows you to post content either as a person or an organization, which is particularly useful for managing social media activities or marketing efforts that involve LinkedIn."}, {"file_name": "n8n-nodes-base.msg91", "summary": "You would use the MSG91 node type when you want to automate SMS messaging workflows within n8n, allowing you to send SMS messages via the MSG91 platform while integrating it with other applications in your automation processes."}, {"file_name": "n8n-nodes-base.awss3", "summary": "You would use the AWS S3 node type in n8n to automate interactions with AWS S3, such as creating, deleting, and managing buckets, as well as handling files and folders within S3. This node is ideal for workflows that require integration of AWS S3 capabilities with other applications or services, enabling actions like uploading, downloading, or organizing files in the cloud."}, {"file_name": "n8n-nodes-base.contentful", "summary": "You would use the Contentful node in n8n to automate interactions with the Contentful content management system and to integrate it with other applications. This node allows you to perform various operations such as retrieving assets, content types, entries, locales, and spaces, making it useful for workflows that involve content management and integration with other services."}, {"file_name": "n8n-nodes-base.hunter", "summary": "You would use the Hunter node type when you need to automate tasks related to email management in Hunter, such as retrieving, generating, or verifying email addresses associated with specific domains. This node is particularly useful for integrating email functionalities into workflows, allowing you to streamline email discovery and validation processes with other applications."}, {"file_name": "n8n-nodes-base.wise", "summary": "You would use the Wise node in n8n to automate financial tasks such as retrieving account information, managing exchange rates, handling recipients, creating quotes, and executing transfers within the Wise application. This integration is beneficial for users looking to streamline workflows that involve currency exchange and international money transfers, allowing them to connect Wise with other applications and services for increased efficiency."}, {"file_name": "n8n-nodes-base.mailgun", "summary": "You would use the Mailgun node in n8n when you want to automate email sending through Mailgun and integrate it with other applications within your workflows. This node is specifically designed to improve efficiency by allowing seamless operations such as sending emails using Mailgun."}, {"file_name": "n8n-nodes-base.microsoftentra", "summary": "You would use the Microsoft Entra ID node in n8n to automate and integrate tasks related to user and group management within Microsoft Entra ID. This includes operations such as creating, updating, retrieving, and deleting users and groups, as well as managing group memberships. It is particularly useful for organizations looking to streamline their identity management processes and connect Microsoft Entra ID with other applications in their workflow."}, {"file_name": "n8n-nodes-base.netscaleradc", "summary": "You would use the Netscaler ADC node in n8n to automate tasks and integrate Citrix Netscaler ADC functionalities into your workflows. This node allows for operations such as creating and installing certificates, as well as managing files (delete, download, upload). It's suitable for users looking to streamline their interactions with Netscaler ADC while also connecting it with other applications in their automation processes."}, {"file_name": "n8n-nodes-base.awscomprehend", "summary": "You would use the AWS Comprehend node type in n8n to automate tasks related to text analysis and language identification within AWS Comprehend. This node integrates AWS Comprehend's capabilities, such as identifying dominant languages in text and analyzing sentiment, into your workflows, allowing you to seamlessly connect these functionalities with other applications."}, {"file_name": "n8n-nodes-base.linear", "summary": "You would use the Linear node type in n8n to automate tasks within Linear and connect it with other applications. This node supports various operations related to issues, such as creating, updating, and deleting issues, making it ideal for workflows that involve project management and issue tracking."}, {"file_name": "n8n-nodes-base.servicenow", "summary": "You would use the ServiceNow node in n8n to automate tasks within ServiceNow and integrate it with other applications. This node supports a variety of operations such as creating, updating, and deleting incidents, users, and table records, as well as retrieving information about business services, configuration items, departments, and user roles. It is useful for enhancing workflow efficiency and connectivity between ServiceNow and different systems."}, {"file_name": "n8n-nodes-base.redis", "summary": "You would use the Redis node in n8n when you need to automate operations with Redis, such as managing key-value pairs, publishing messages, or integrating Redis with other applications in your workflows. It supports various operations like deleting keys, getting and setting key values, incrementing keys, and more, making it useful for tasks that involve data storage and messaging in Redis."}, {"file_name": "n8n-nodes-base.googletasks", "summary": "You would use the Google Tasks node in n8n to automate and manage tasks within Google Tasks, allowing for integration with other applications. It supports operations such as adding, updating, retrieving, and deleting tasks, making it useful for workflows that require task organization and automation."}, {"file_name": "n8n-nodes-base.agilecrm", "summary": "You would use the Agile CRM node type in n8n to automate tasks and integrate Agile CRM with other applications. This includes managing entities like companies, contacts, and deals by creating, reading, updating, and deleting them within your workflows."}, {"file_name": "n8n-nodes-base.automizy", "summary": "You would use the Automizy node type in n8n when you want to automate tasks related to email marketing, such as managing contacts and lists within Automizy. This node facilitates operations like creating, updating, or deleting contacts and lists, enabling seamless integration of Automizy with other applications and workflows."}, {"file_name": "n8n-nodes-base.googlecloudstorage", "summary": "You would use the Google Cloud Storage node in n8n to automate tasks involving Google Cloud Storage, such as creating, updating, deleting, and retrieving buckets and objects. This node is ideal for integrating Google Cloud Storage with other applications and workflows, allowing for seamless management of files and data stored in Google Cloud."}, {"file_name": "n8n-nodes-base.netlify", "summary": "Use the Netlify node to automate tasks in Netlify and integrate its functionalities with other applications. This node type is suitable for managing deployments, such as creating, cancelling, and retrieving them, as well as handling site management tasks like getting and deleting sites."}, {"file_name": "n8n-nodes-base.gitlab", "summary": "You would use the GitLab node type in n8n to automate tasks and workflows involving GitLab, such as managing issues, repositories, releases, and users. This integration allows you to create, update, delete, and retrieve various GitLab objects programmatically, enhancing productivity by connecting GitLab actions with other applications in your workflows."}, {"file_name": "n8n-nodes-base.vero", "summary": "You would use the Vero node in n8n to automate tasks related to user management and event tracking within the Vero application. This includes creating, updating, unsubscribing, or deleting user profiles, managing tags associated with users, and tracking specific events for customers. Integrating this node into your workflows allows for seamless interaction between Vero and other applications."}, {"file_name": "n8n-nodes-base.discord", "summary": "You would use the Discord node in n8n to automate tasks within Discord and to integrate Discord with other applications. It supports various operations such as creating, deleting, and updating channels, sending and managing messages, and handling members and roles. This node is particularly useful for users looking to enhance their workflows by leveraging Discord's features in conjunction with other services."}, {"file_name": "n8n-nodes-base.postbin", "summary": "You would use the PostBin node in n8n to test API clients and webhooks by automating interactions with the PostBin service. This node allows you to create, delete, and retrieve bins as well as send requests to specific bins, making it useful for developers looking to streamline their testing and integration workflows."}, {"file_name": "n8n-nodes-base.paddle", "summary": "You would use the Paddle node in n8n to automate various tasks related to Paddle, such as creating, updating, and retrieving coupons, payment information, plans, products, and user data. This node allows for seamless integration of Paddle functionalities into workflows, enabling efficient management of subscriptions, discounts, and product offerings across different applications."}, {"file_name": "n8n-nodes-base.wordpress", "summary": "You would use the WordPress node in n8n to automate tasks and integrate WordPress with other applications. This node allows you to perform various operations such as creating, updating, and retrieving posts, pages, and users within WordPress, making it ideal for workflows that require interaction with WordPress data."}, {"file_name": "n8n-nodes-base.adalo", "summary": "You would use the Adalo node type in n8n when you want to automate tasks within the Adalo platform or integrate Adalo with other applications. This node provides operations like creating, retrieving, updating, and deleting databases, records, and collections in Adalo, making it suitable for workflow automation and enhancing productivity."}, {"file_name": "n8n-nodes-base.egoi", "summary": "The E-goi node type in n8n is used when you want to automate tasks in the E-goi marketing platform and integrate it with other applications. You would use this node to manage contact information, such as creating, updating, retrieving, and deleting members in E-goi. It is particularly useful for workflows that involve interaction with E-goi's features related to contacts."}, {"file_name": "n8n-nodes-base.getresponse", "summary": "You would use the GetResponse node type in n8n to automate tasks related to managing contacts in the GetResponse email marketing platform. It enables workflow integrations by allowing you to create, update, delete, and retrieve contact information seamlessly. This is ideal for users looking to enhance their marketing automation processes by connecting GetResponse with other applications."}, {"file_name": "n8n-nodes-base.dhl", "summary": "You would use the DHL node in n8n to automate and integrate DHL services within your workflows, specifically for tasks such as tracking shipments. It allows seamless connectivity between DHL and other applications, enhancing productivity by automating routine processes."}, {"file_name": "n8n-nodes-base.deepl", "summary": "You would use the DeepL node in n8n to automate translation tasks and integrate DeepL's language services into your workflows. This node allows you to effortlessly translate text between languages as part of your automation processes, making it useful for applications that require multilingual capabilities."}, {"file_name": "n8n-nodes-base.harvest", "summary": "You would use the Harvest node type in n8n to automate tasks related to the Harvest application, such as managing clients, invoices, projects, and users. It is ideal for those looking to streamline workflows by integrating Harvest with other applications and performing operations like creating, updating, and deleting resources within Harvest."}, {"file_name": "n8n-nodes-base.pushover", "summary": "You would use the Pushover node type in n8n to automate sending push notifications to users via the Pushover service, enabling seamless integration of notifications into your workflows across various applications."}, {"file_name": "n8n-nodes-base.medium", "summary": "You would use the Medium node type in n8n to automate tasks related to creating posts and retrieving publications on Medium, allowing for seamless integration of Medium functionalities into your workflows with other applications. It is particularly useful for users looking to publish content or manage their Medium publications programmatically."}, {"file_name": "n8n-nodes-base.onesimpleapi", "summary": "You would use the One Simple API node in n8n when you want to automate tasks that involve interacting with One Simple API services, such as retrieving social media profile details, converting currencies, generating QR codes, or gathering website metadata. This node allows seamless integration of One Simple API functionalities into your workflows, making it easier to access and manipulate data from various services without manual effort."}, {"file_name": "n8n-nodes-base.disqus", "summary": "You would use the Disqus node type in n8n when you want to automate tasks related to Disqus and integrate its functionalities with other applications. This node allows you to retrieve details about forums, categories, threads, and posts, making it useful for workflows that involve content management, community engagement, or data analysis related to discussions on Disqus."}, {"file_name": "n8n-nodes-base.jenkins", "summary": "You would use the Jenkins node type in n8n when you want to automate tasks in Jenkins and connect it with other applications within your workflows. This node provides various operations such as managing builds, controlling instance states (like quiet mode, restart, and shutdown), and handling jobs (including triggering, copying, and creating jobs), making it suitable for seamless integration of Jenkins functionalities into automated processes."}, {"file_name": "n8n-nodes-base.googleslides", "summary": "You would use the Google Slides node in n8n to automate tasks within Google Slides and to integrate it with other applications in your workflows. This node is particularly useful for actions such as creating presentations, retrieving pages or their thumbnails, and managing text in presentations, allowing for seamless operation and enhanced productivity in managing presentations."}, {"file_name": "n8n-nodes-base.tapfiliate", "summary": "You would use the Tapfiliate node in n8n to automate tasks related to affiliate management in the Tapfiliate platform, such as creating or deleting affiliates, managing affiliate metadata, and handling affiliate program participation. This node integrates Tapfiliate with other applications to streamline workflows involving affiliate marketing."}, {"file_name": "n8n-nodes-base.dropbox", "summary": "You would use the Dropbox node type in n8n when you want to automate tasks and integrate Dropbox functionalities with other applications within your workflows. This node is particularly useful for operations such as creating, downloading, moving, and copying files and folders in Dropbox, allowing for efficient management of your Dropbox content."}, {"file_name": "n8n-nodes-base.autopilot", "summary": "You would use the Autopilot node in n8n when you need to automate tasks within the Autopilot CRM system and integrate it with other applications. This node supports various operations like managing contacts (creating, updating, deleting, retrieving), managing contact lists, and creating new lists. It is particularly useful for workflow automation that involves customer relationship management processes."}, {"file_name": "n8n-nodes-base.mailcheck", "summary": "You would use the Mailcheck node type in n8n to automate and integrate email checking and related tasks with other applications within your workflows. It supports operations such as verifying the validity of email addresses."}, {"file_name": "n8n-nodes-base.affinity", "summary": "You would use the Affinity node in n8n when you want to automate tasks and integrate Affinity with other applications. This node supports a variety of operations like creating, retrieving, updating, and deleting lists, entries, organizations, and persons within Affinity, making it useful for managing data and workflows in a streamlined manner."}, {"file_name": "n8n-nodes-base.hackernews", "summary": "You would use the Hacker News node in n8n to automate interactions with Hacker News and integrate its features into your workflows. This node allows you to retrieve articles and user information without requiring authentication, making it suitable for developers looking to leverage Hacker News data alongside other applications."}, {"file_name": "n8n-nodes-base.googledrive", "summary": "You would use the Google Drive node in n8n when you need to automate tasks in Google Drive or integrate its functionalities with other applications. This includes operations such as creating, updating, deleting, and managing files and folders, as well as handling shared drives. It is particularly useful for automating workflows that involve document management or collaboration."}, {"file_name": "n8n-nodes-base.cratedb", "summary": "You would use the CrateDB node when you need to automate tasks in CrateDB or integrate it with other applications in your n8n workflows. This node allows you to execute SQL queries, insert, and update rows in the CrateDB database, making it suitable for dynamic database operations and integrations."}, {"file_name": "n8n-nodes-base.todoist", "summary": "You would use the Todoist node in n8n to automate task management within Todoist and to integrate Todoist with other applications. It allows for operations such as creating, updating, deleting, and retrieving tasks, making it ideal for workflows that require interaction with Todoist for productivity and task organization."}, {"file_name": "n8n-nodes-base.sms77", "summary": "You would use the seven node type in n8n when you want to automate tasks related to SMS messaging and voice calls. This includes sending SMS messages and converting text to voice for calls, allowing you to integrate these features into your workflows and connect them with other applications."}, {"file_name": "n8n-nodes-base.invoiceninja", "summary": "You would use the Invoice Ninja node in n8n when you want to automate tasks within Invoice Ninja and integrate it with other applications. This node allows you to perform various actions such as creating, updating, deleting, and fetching data for clients, expenses, invoices, payments, quotes, and tasks. It is particularly useful for streamlining invoicing processes and managing client information efficiently."}, {"file_name": "n8n-nodes-base.twake", "summary": "You would use the Twake node type in n8n to automate tasks and workflows within the Twake collaboration platform, particularly for sending messages. It is useful for integrating Twake with other applications, allowing for streamlined communication and automation in your processes."}, {"file_name": "n8n-nodes-base.salesmate", "summary": "You would use the Salesmate node in n8n to automate tasks and integrate Salesmate with other applications. This node supports operations for managing activities, companies, and deals within Salesmate, allowing you to create, update, delete, and retrieve information as part of your workflows."}, {"file_name": "n8n-nodes-base.coingecko", "summary": "You would use the CoinGecko node type when you want to automate tasks related to cryptocurrency data, such as retrieving current and historical coin data, market information, and event details from CoinGecko. This node integrates CoinGecko functionalities within your n8n workflows, allowing you to gather and utilize a wide range of cryptocurrency-related information efficiently."}, {"file_name": "n8n-nodes-base.syncromsp", "summary": "You would use the SyncroMSP node type in n8n to automate and streamline tasks within SyncroMSP, such as managing customers, contacts, tickets, and RMM alerts. This node allows for integrating SyncroMSP with other applications, enhancing workflow efficiency. It is ideal for users who need to create, update, retrieve, or delete records related to these entities, thereby facilitating greater operational control and connectivity across systems."}, {"file_name": "n8n-nodes-base.mysql", "summary": "You would use the MySQL node type in n8n when you need to automate tasks involving a MySQL database, such as executing SQL queries, inserting or updating data, and integrating MySQL with other applications. This node supports various operations including Delete, Execute SQL, Insert, Insert or Update, Select, and Update, making it versatile for managing database interactions in automated workflows."}, {"file_name": "n8n-nodes-base.microsoftonedrive", "summary": "You would use the Microsoft OneDrive node type in n8n to automate tasks and integrate Microsoft OneDrive with other applications. It can handle various file and folder operations such as creating, updating, deleting, downloading, and sharing, making it suitable for workflows that require interaction with OneDrive data."}, {"file_name": "n8n-nodes-base.convertkit", "summary": "The ConvertKit node is used to automate tasks within ConvertKit and integrate it with other applications in your workflows. You would use this node type when you need to manage subscribers, tags, custom fields, and forms in ConvertKit. It supports operations such as adding or deleting subscribers, managing tags and custom fields, and retrieving data related to forms and sequences."}, {"file_name": "n8n-nodes-base.twitter", "summary": "You would use the X (Formerly Twitter) node type in n8n when you want to automate tasks related to X, such as sending direct messages, posting or managing tweets, liking, searching for tweets, and retweeting. It enables integration of X with other applications, streamlining workflows involving social media interactions."}, {"file_name": "n8n-nodes-base.helpscout", "summary": "You would use the Help Scout node in n8n to automate tasks within Help Scout and integrate it with other applications. This is useful for streamlining workflows that involve managing conversations and customers. The node supports various operations such as creating, updating, and retrieving conversations and customer data, making it ideal for enhancing customer support processes and improving operational efficiency."}, {"file_name": "n8n-nodes-base.strava", "summary": "You would use the Strava node type in n8n when you want to automate tasks related to Strava, such as creating or retrieving activity information. It is useful for integrating Strava with other applications, enabling workflows that involve tracking sports activities, managing your exercise data, or interacting with other services based on Strava data."}, {"file_name": "n8n-nodes-base.mailchimp", "summary": "You would use the Mailchimp node in n8n to automate tasks and integrate Mailchimp with other applications. This node allows you to manage campaigns, including creating, updating, sending, and deleting them, as well as managing list members and their associated tags. It's ideal for streamlining email marketing processes and connecting Mailchimp functionalities with various workflows."}, {"file_name": "n8n-nodes-base.gotify", "summary": "You would use the Gotify node type in n8n when you want to automate messaging tasks within Gotify or integrate Gotify with other applications in your workflows. This node allows for various operations, such as creating, deleting, and retrieving messages, enhancing your ability to manage notifications and messages efficiently."}, {"file_name": "n8n-nodes-base.kafka", "summary": "You would use the Kafka node in n8n to automate tasks within Kafka and connect it with other applications, particularly for sending messages and utilizing various Kafka features in your workflows."}, {"file_name": "n8n-nodes-base.apitemplateio", "summary": "You would use the APITemplate.io node in n8n to automate tasks and integrate APITemplate.io with other applications, particularly for operations such as managing accounts and generating images or PDFs. This node is useful when you need to streamline workflows involving APITemplate.io functionalities."}, {"file_name": "n8n-nodes-base.actionnetwork", "summary": "You would use the Action Network node type in n8n to automate tasks associated with the Action Network platform, such as managing events, people, signatures, and tags. It allows you to create, update, and delete these entities, making it ideal for integrating Action Network functionalities into your workflows and connecting it with other applications."}, {"file_name": "n8n-nodes-base.vonage", "summary": "You would use the Vonage node type in n8n to automate tasks involving the Vonage service, such as sending SMS messages. This node is useful when you want to integrate Vonage's communication capabilities into your workflows, allowing for seamless interaction between Vonage and other applications."}, {"file_name": "n8n-nodes-base.mondaycom", "summary": "You would use the monday.com node type in n8n to automate tasks and streamline workflows involving monday.com, allowing you to perform operations such as creating boards, adding or deleting items, and managing columns and groups on those boards. This node integrates monday.com with other applications, facilitating better project management and collaboration."}, {"file_name": "n8n-nodes-base.googlecloudfirestore", "summary": "You would use the Google Cloud Firestore node type in n8n when you need to automate tasks related to Google Cloud Firestore, such as creating, updating, deleting, or retrieving documents and collections. This node is valuable for integrating Firestore with other applications in your workflows, especially if you want to manage your database entries programmatically."}, {"file_name": "n8n-nodes-base.microsoftgraphsecurity", "summary": "You would use the Microsoft Graph Security node in n8n to automate and integrate tasks related to Microsoft Graph Security into your workflows. This node allows you to manage Secure Scores and Secure Score Control Profiles, including retrieving and updating their information. It is particularly beneficial for users looking to enhance their security management processes and streamline interactions with Microsoft Graph Security features."}, {"file_name": "n8n-nodes-base.jira", "summary": "You would use the Jira Software node in n8n to automate and streamline workflows involving Jira by integrating it with other applications. This node allows you to perform various operations related to issues, attachments, and users within Jira, such as creating, updating, deleting, and fetching information about issues and users. It's particularly useful when you want to enhance productivity by automating tasks like issue tracking and notifications directly through your workflows."}, {"file_name": "n8n-nodes-base.googleads", "summary": "You would use the Google Ads node in n8n to automate processes related to Google Ads, such as managing campaigns and integrating Google Ads data with other applications or services. This node allows you to retrieve information about your campaigns, making it ideal for users looking to streamline their advertising efforts and enhance workflow efficiency."}, {"file_name": "n8n-nodes-base.uplead", "summary": "You would use the UpLead node type in n8n to automate tasks related to UpLead, such as enriching company and personal information, and to integrate UpLead's functionalities with other applications in your workflow."}, {"file_name": "n8n-nodes-langchain.openai", "summary": "You would use the OpenAI node type in n8n to automate tasks and integrate OpenAI functionalities with other applications. This node supports various operations such as creating and managing assistants, messaging models, generating and analyzing images and audio, and handling files. It is beneficial for workflows that require AI capabilities like chat interactions, content generation, or media processing."}, {"file_name": "n8n-nodes-base.paypal", "summary": "You would use the PayPal node type in n8n when you want to automate tasks related to PayPal, such as creating batch payouts and managing payout items, including canceling unclaimed payouts. This node allows for seamless integration of PayPal with other applications in your workflow, enhancing payment processing and financial automation."}, {"file_name": "n8n-nodes-base.matrix", "summary": "You would use the Matrix node type when you want to automate tasks within the Matrix communication platform and integrate it with other applications. This includes managing user accounts, sending messages and media in chat rooms, and handling room memberships."}, {"file_name": "n8n-nodes-base.bitly", "summary": "You would use the Bitly node in n8n to automate tasks related to link management and integrate Bitly with other applications. This node supports operations such as creating, retrieving, and updating links, making it useful for workflows that require URL shortening or link tracking functionalities."}, {"file_name": "n8n-nodes-base.lingvanex", "summary": "You would use the LingvaNex node type in n8n to automate translations and integrate the LingvaNex translation service with other applications in your workflows."}, {"file_name": "n8n-nodes-base.magento2", "summary": "You would use the Magento 2 node in n8n to automate tasks and integrate Magento 2 with other applications. This node supports various operations related to customers, invoices, orders, and products, enabling actions such as creating, updating, deleting, and retrieving these entities. It is ideal for workflows that require automated management of e-commerce processes within a Magento 2 environment."}, {"file_name": "n8n-nodes-base.profitwell", "summary": "You would use the ProfitWell node in n8n to automate tasks related to ProfitWell, such as retrieving your company's account settings and financial metrics. This node is particularly beneficial for integrating ProfitWell data with other applications, allowing for streamlined workflows and data management."}, {"file_name": "n8n-nodes-base.raindrop", "summary": "You would use the Raindrop node in n8n to automate and integrate tasks related to Raindrop, such as managing bookmarks, collections, and tags, as well as retrieving user information. This node is ideal for workflows that require creating, updating, or deleting bookmarks and collections or managing tags effectively in coordination with other applications."}, {"file_name": "n8n-nodes-base.monicacrm", "summary": "You would use the Monica CRM node type in n8n to automate and integrate various functionalities within Monica CRM and between Monica CRM and other applications. This node allows you to manage activities, calls, contacts, notes, tasks, and more, utilizing features such as creating, updating, deleting, and retrieving these elements. It's beneficial for workflows that require handling customer relationship management tasks seamlessly and enhancing productivity through automation."}, {"file_name": "n8n-nodes-base.awssqs", "summary": "You would use the AWS SQS node type in n8n to integrate and automate workflow processes with AWS Simple Queue Service (SQS). This node allows you to send messages to SQS queues, enabling communication between applications or services within AWS and other systems."}, {"file_name": "n8n-nodes-base.grist", "summary": "You would use the Grist node type in n8n when you want to automate tasks in Grist, such as creating, updating, deleting, or retrieving rows from a table. This node is essential for integrating Grist with other applications, enabling seamless workflows that involve data manipulation within Grist."}, {"file_name": "n8n-nodes-base.bannerbear", "summary": "You would use the Bannerbear node type in n8n to automate tasks related to creating and managing images and templates within the Bannerbear platform. This node is useful for integrating Bannerbear's features with other applications, allowing for streamlined workflows in generating images and accessing template data."}, {"file_name": "n8n-nodes-base.securityscorecard", "summary": "You would use the SecurityScorecard node in n8n to automate tasks related to security assessments and integrate SecurityScorecard features with other applications. This node is beneficial for managing organizational security information, such as retrieving company security scores, historical data, managing portfolios of companies, and generating reports. It allows users to automate workflows that involve monitoring and improving security metrics."}, {"file_name": "n8n-nodes-base.mailerlite", "summary": "You would use the MailerLite node in n8n to automate interactions with MailerLite, such as managing subscribers by creating, updating, retrieving, or deleting them. This node is essential for integrating MailerLite into broader workflows, allowing for seamless automation tasks between MailerLite and other applications."}, {"file_name": "n8n-nodes-base.ghost", "summary": "You would use the Ghost node in n8n to automate tasks and workflows involving the Ghost blogging platform. This node allows you to create, update, delete, and retrieve posts using both the Admin and Content APIs of Ghost. It is ideal for users looking to integrate Ghost with other applications and streamline their content management processes."}, {"file_name": "n8n-nodes-base.travisci", "summary": "You would use the Travis CI node type in n8n when you need to automate tasks related to Travis CI, such as managing builds—triggering, cancelling, or retrieving information about builds. This node facilitates integration between Travis CI and other applications, enhancing workflow automation."}, {"file_name": "n8n-nodes-base.yourls", "summary": "You would use the Yourls node type in n8n when you need to automate tasks related to URL shortening or expanding within the Yourls platform. This node allows for the integration of Yourls with other applications, enabling operations such as shortening URLs, expanding existing URLs, and retrieving statistics about specific short URLs."}, {"file_name": "n8n-nodes-base.humanticai", "summary": "You would use the Humantic AI node type when you want to automate tasks related to Humantic AI, such as creating, retrieving, or updating profiles, and when you need to integrate Humantic AI with other applications within your n8n workflows."}, {"file_name": "n8n-nodes-base.nextcloud", "summary": "You would use the Nextcloud node when you want to automate tasks within Nextcloud or integrate it with other applications, such as managing files and folders (creating, copying, moving, deleting), as well as handling user accounts (inviting users, retrieving user information). This node is useful for enhancing productivity and streamlining workflow processes that involve Nextcloud."}, {"file_name": "n8n-nodes-base.freshservice", "summary": "You would use the Freshservice node type in n8n to automate and streamline operations within Freshservice, such as managing agents, departments, tickets, and announcements, as well as integrating these features with other applications in your workflow."}, {"file_name": "n8n-nodes-base.awsses", "summary": "You would use the AWS SES node type in n8n when you need to automate email-related tasks using Amazon Simple Email Service (SES). This includes operations such as sending emails, managing email templates, and handling custom verification emails. It is beneficial for integrating AWS SES with other applications and workflows for automated email management or notification systems."}, {"file_name": "n8n-nodes-base.iterable", "summary": "You would use the Iterable node type in n8n to automate tasks within the Iterable platform and integrate it with other applications. This node is suitable for operations such as creating, updating, or deleting users, recording user actions, and managing user lists by adding or removing users. It is ideal for workflows that require interaction with Iterable's features for user management and event tracking."}, {"file_name": "n8n-nodes-base.customerio", "summary": "You would use the Customer.io node in n8n to automate tasks within Customer.io and connect it with other applications. This node is suitable for managing customer data, tracking events, and retrieving campaign metrics, allowing for streamlined workflows involving customer interaction and data management."}, {"file_name": "n8n-nodes-base.cloudflare", "summary": "You would use the Cloudflare node in n8n to automate tasks and integrate Cloudflare with other applications, particularly for managing zone certificates such as deleting, retrieving, or uploading them. This node is beneficial when you need to streamline Cloudflare-related workflows and enhance automation in your projects."}, {"file_name": "n8n-nodes-base.mindee", "summary": "You would use the Mindee node in n8n to automate tasks involving document processing, specifically for predicting invoices and receipts. This node allows you to integrate Mindee's features into your workflows, streamlining the handling of such documents in conjunction with other applications."}, {"file_name": "n8n-nodes-base.plivo", "summary": "You would use the Plivo node type in n8n to automate tasks involving Plivo, such as making voice calls or sending SMS/MMS messages. This node integrates Plivo services with other applications in your workflow, streamlining communication processes."}, {"file_name": "n8n-nodes-base.highlevel", "summary": "You would use the HighLevel node type in n8n to automate processes within the HighLevel application, enabling integration with other systems. This node facilitates various operations such as creating, updating, deleting, and retrieving contacts, opportunities, and tasks. Additionally, it allows for booking appointments and checking calendar availability. It is ideal for users looking to streamline their workflows involving customer relationship management and task management in HighLevel."}, {"file_name": "n8n-nodes-base.uproc", "summary": "The uProc node in n8n is used to automate workflows involving data processing and retrieval from uProc's extensive suite of services. You would use this node type when you need to access features such as verifying email validity, obtaining social media data, checking company information, managing financial queries, and performing geographical checks. Additionally, the uProc node can handle multimedia processing like audio file generation, image metadata extraction, and QR code management, making it suitable for integrations requiring extensive data validation and enrichment across various applications."}, {"file_name": "n8n-nodes-base.chargebee", "summary": "You would use the Chargebee node type in n8n to automate tasks within Chargebee and to integrate Chargebee with other applications. It enables various operations such as creating customers, retrieving invoices, and managing subscriptions (including cancellation and deletion). This node is ideal for workflows that require interaction with Chargebee's functionalities."}, {"file_name": "n8n-nodes-base.sendy", "summary": "You would use the Sendy node in n8n when you want to automate tasks related to email marketing and subscriber management within Sendy. It allows you to create campaigns and manage subscriber lists effectively by adding, counting, deleting, and tracking the status of subscribers. This integration is beneficial for connecting Sendy with other applications in your automated workflows."}, {"file_name": "n8n-nodes-base.googlebusinessprofile", "summary": "You would use the Google Business Profile node in n8n to automate tasks related to Google Business Profile, such as creating, updating, or deleting posts and reviews. This node enables integration with other applications and supports various operations, allowing for efficient management of your business profile across workflows."}, {"file_name": "n8n-nodes-base.mattermost", "summary": "You would use the Mattermost node type in n8n when you want to automate tasks and integrate Mattermost functionalities into your workflows. This includes operations such as managing channels and users, posting messages, and handling reactions within Mattermost. The node supports a variety of actions that can streamline communication processes, making it ideal for enhancing collaboration and efficiency in teams using Mattermost."}, {"file_name": "n8n-nodes-base.googlebooks", "summary": "You would use the Google Books node type in n8n when you want to automate tasks related to Google Books or integrate Google Books with other applications. This node allows you to manage bookshelves, add or remove volumes, and retrieve specific book information, making it useful for automating workflows that involve handling books or organizing reading lists."}, {"file_name": "n8n-nodes-base.googlechat", "summary": "You would use the Google Chat node in n8n when you want to automate tasks related to Google Chat or integrate it with other applications. This node allows you to perform various operations such as managing memberships, creating, deleting, updating, and retrieving messages, and accessing available spaces. It's beneficial for workflows that require interaction with Google Chat features, enhancing productivity and automating communication tasks."}, {"file_name": "n8n-nodes-base.erpnext", "summary": "Use the ERPNext node in n8n to automate interactions with ERPNext, enabling you to create, update, retrieve, and delete documents within ERPNext as part of your workflow. This node is ideal for integrating ERPNext with other applications, making it useful for businesses looking to streamline and automate their processes."}, {"file_name": "n8n-nodes-base.peekalink", "summary": "You would use the Peekalink node in n8n to automate the checking and reviewing of links by integrating Peekalink into your workflows. This node is useful whenever you need to see if a preview for a link is available or to retrieve the preview information for links, enhancing the workflow by allowing interactions with other applications based on link data."}, {"file_name": "n8n-nodes-base.gmail", "summary": "You would use the Gmail node in n8n to automate tasks in Gmail and integrate it with other applications. This includes operations like creating, updating, deleting, and retrieving drafts, messages, labels, and threads. It is particularly useful for managing email workflows, such as sending automated responses, organizing emails with labels, and retrieving or manipulating email content based on triggers and conditions."}, {"file_name": "n8n-nodes-base.uptimerobot", "summary": "You would use the UptimeRobot node in n8n when you want to automate interactions with UptimeRobot, such as creating, modifying, or deleting alerts and monitors, and integrating these actions with other applications in your workflows."}, {"file_name": "n8n-nodes-base.urlscanio", "summary": "You would use the urlscan.io node type in n8n to automate interactions with the urlscan.io service, allowing for the integration of its scanning functionalities into your workflows. This node supports operations such as performing scans and retrieving scan data, making it valuable for users who need to automate web scanning tasks or analyze URLs within their applications."}, {"file_name": "n8n-nodes-base.spotify", "summary": "You would use the Spotify node in n8n to automate tasks and workflows involving Spotify, such as retrieving album and artist information, managing playlists, and controlling music playback. This node enables integration with other applications, allowing you to perform various operations like getting liked tracks, searching for music, and managing music playback settings."}, {"file_name": "n8n-nodes-base.brevo", "summary": "You would use the Brevo node type in n8n to automate tasks within Brevo and integrate its functionalities with other applications. It allows you to perform various operations such as creating, updating, deleting, and retrieving contacts and attributes, as well as sending emails and managing senders. This makes it particularly useful for workflows that involve email marketing or contact management."}, {"file_name": "n8n-nodes-base.slack", "summary": "You would use the Slack node type in n8n to automate tasks within Slack and facilitate integrations with other applications. This node is particularly useful for operations involving channels (creating, archiving, inviting users), file management (uploading, retrieving files), message handling (sending, deleting, updating messages), user interactions (gathering user information, managing user profiles), and user group functions (creating and managing user groups). It is ideal for workflows that require interaction with various Slack functionalities, enhancing communication and productivity."}, {"file_name": "n8n-nodes-base.kobotoolbox", "summary": "You would use the KoboToolbox node in n8n to automate tasks related to KoboToolbox, such as creating, updating, deleting, and retrieving files, forms, and submissions. It is particularly useful for integrating KoboToolbox with other applications within workflows to streamline data collection and management processes."}, {"file_name": "n8n-nodes-base.venafitlsprotectdatacenter", "summary": "You would use the Venafi TLS Protect Datacenter node in n8n to automate tasks and workflows involving certificate management within the Venafi TLS Protect Datacenter, enabling operations such as creating, deleting, downloading, retrieving, and renewing certificates, as well as managing policies. This integration allows for seamless connection and interaction between Venafi TLS Protect Datacenter and other applications within your n8n workflows."}, {"file_name": "n8n-nodes-base.clickup", "summary": "You would use the ClickUp node in n8n when you want to automate tasks and workflows within ClickUp, integrating it with other applications. This node supports various operations such as creating, updating, and deleting items like checklists, tasks, comments, goals, and folders, allowing for comprehensive management of ClickUp resources."}, {"file_name": "n8n-nodes-base.crowddev", "summary": "You would use the crowd.dev node type in n8n when you want to automate tasks and integrate crowd.dev's functionalities within your workflows. This node allows you to create, update, delete, and find various entities such as members, notes, organizations, and tasks in crowd.dev, enhancing productivity and coordination through workflow automation."}, {"file_name": "n8n-nodes-base.metabase", "summary": "You would use the Metabase node type in n8n to automate tasks within Metabase and to integrate Metabase functionalities with other applications. It supports various operations such as managing alerts, databases, metrics, and questions, allowing for streamlined workflows that enhance data management and analysis."}, {"file_name": "n8n-nodes-base.segment", "summary": "You would use the Segment node in n8n to automate tasks within Segment and connect Segment with other applications. This node allows you to manage user groups, create identities, and track user activities, such as recording actions and page views. It is particularly useful for marketing automation, event tracking, and user management within workflows."}, {"file_name": "n8n-nodes-base.googletranslate", "summary": "You would use the Google Translate node in n8n to automate translations and integrate Google Translate capabilities into your workflows. This node supports operations like translating data between different languages, allowing seamless interaction with other applications that require translation services."}, {"file_name": "n8n-nodes-base.questdb", "summary": "You would use the QuestDB node in n8n to automate operations involving QuestDB, such as executing SQL queries and inserting rows into a database. This node is particularly useful for integrating QuestDB with other applications in your workflow, enabling seamless data management and interaction."}, {"file_name": "n8n-nodes-base.nocodb", "summary": "You would use the NocoDB node type in n8n when you need to automate interactions with NocoDB, such as creating, updating, retrieving, or deleting data rows. This node is useful for integrating NocoDB with other applications and streamlining workflows that include database management tasks."}, {"file_name": "n8n-nodes-base.salesforce", "summary": "You would use the Salesforce node type in n8n when you want to automate tasks within Salesforce or integrate Salesforce with other applications. This node enables operations like creating, updating, deleting, and retrieving various Salesforce objects such as accounts, contacts, leads, cases, and documents. It is particularly useful for automating workflows by connecting Salesforce data to other systems or applications, and allows for the handling of custom fields and advanced features within Salesforce."}, {"file_name": "n8n-nodes-base.cortex", "summary": "You would use the Cortex node in n8n when you want to automate workflows within Cortex or integrate Cortex functionalities with other applications. This node allows you to execute analyzers and responders, as well as retrieve job details and reports, making it suitable for tasks that involve data analysis and reporting within your automation processes."}, {"file_name": "n8n-nodes-base.sentryio", "summary": "You would use the Sentry.io node in n8n when you want to automate workflows involving Sentry.io, allowing you to manage issues, projects, releases, organizations, and teams. This node facilitates integration with other applications by enabling actions such as creating, updating, deleting, and retrieving information related to Sentry.io's features."}, {"file_name": "n8n-nodes-base.merge", "summary": "You would use the Merge node in n8n when you need to combine data from multiple streams or sources, ensuring that all data is available before merging. It supports various modes of merging, such as appending data sequentially, combining data by matching fields, combining by position, or producing all possible combinations of items. This node is ideal for scenarios where you need to enrich datasets, align items based on specific criteria, or perform complex data integrations within your workflows."}, {"file_name": "n8n-nodes-base.renamekeys", "summary": "You would use the Rename Keys node when you need to rename one or multiple keys within a key-value pair in your workflow. This is particularly useful for transforming datasets where key names may not be suitable for downstream processing or need to be standardized. The node allows for both manual renaming of specified keys and bulk renaming using regular expressions, which is beneficial for complex data structures."}, {"file_name": "n8n-nodes-base.emailimap", "summary": "You would use the Email Trigger (IMAP) node in n8n when you need to receive emails from an IMAP email server as part of your workflow automation. This node acts as a trigger that allows you to specify conditions for fetching emails from a designated mailbox. It is useful for situations where you want to automate processes based on incoming emails, manage email interactions, and optionally handle email attachments."}, {"file_name": "n8n-nodes-base.totp", "summary": "You would use the TOTP node type in n8n when you need to generate time-based one-time passwords for secure authentication processes. This node is particularly useful in scenarios requiring two-factor authentication (2FA) or any system where secure access verification is necessary. The TOTP node allows for configuration of parameters such as the HMAC algorithm, the number of digits in the generated code, and the validity period of the password, providing flexibility for various security requirements."}, {"file_name": "n8n-nodes-base.xml", "summary": "You would use the XML node type in n8n when you need to convert data formats between JSON and XML. This is helpful for integrating systems that require data in a specific format, such as APIs or applications that prefer XML over JSON or vice versa. It can also be used when working with binary files that contain XML data, by first extracting the XML text. Additionally, this node provides options to customize how the conversion is handled, such as controlling attributes and formatting, making it versatile for different XML and JSON structures."}, {"file_name": "n8n-nodes-base.compression", "summary": "You would use the Compression node in n8n when you need to compress files into Zip or Gzip formats for efficient storage or transfer, or when you want to decompress existing compressed files to access their original content. This node facilitates file handling in workflows where file size and management are crucial."}, {"file_name": "n8n-nodes-base.datetime", "summary": "You would use the Date & Time node type in n8n when you need to manipulate date and time data for various purposes in your workflows. This includes operations such as adding or subtracting time from dates, extracting specific parts of a date (like year or month), formatting dates into different styles, calculating the time between two dates, and retrieving the current date with options for including the time. This node is essential for any automation that requires date manipulation or needs to trigger actions based on dates and times."}, {"file_name": "n8n-nodes-base.executeworkflow", "summary": "You would use the Execute Sub-workflow node when you want to run another workflow within your main workflow in n8n, enabling modular and complex automation tasks. This node is beneficial for breaking down large workflows into smaller, reusable components or for executing workflows based on certain conditions. You can source the sub-workflow from the database, a local file, a parameter, or a URL, and control whether the main workflow waits for its completion. It supports processing inputs dynamically and can execute the sub-workflow for all items at once or individually."}, {"file_name": "n8n-nodes-base.n8n", "summary": "You would use the n8n node type when you need to integrate with the n8n API within your workflows. This allows you to perform operations such as managing credentials, executing workflows, and obtaining execution logs. Essentially, this node is suitable for users looking to automate interactions with their n8n instance, including creating, activating, or deleting workflows, as well as generating audits and retrieving execution details."}, {"file_name": "n8n-nodes-base.ldap", "summary": "You would use the LDAP node in n8n when you need to integrate and perform operations on LDAP (Lightweight Directory Access Protocol) servers. This includes tasks such as creating, updating, searching for, renaming, and deleting directory entries. It is useful for managing user data, organizational information, or any other objects within an LDAP directory. The node facilitates various operations by requiring authentication credentials and specific parameters for each action, making it versatile for businesses utilizing LDAP for their directory services."}, {"file_name": "n8n-nodes-base.executiondata", "summary": "You would use the Execution Data node in n8n to save metadata associated with workflow executions for easier searching and referencing later in the Executions list. This node is suitable for tracking custom execution data and is particularly useful when you need to capture key/value pairs of information to enhance your workflow's traceability. Keep in mind that this feature is available only on Pro and Enterprise plans, and there are limitations on the length of keys and values."}, {"file_name": "n8n-nodes-base.graphql", "summary": "You would use the GraphQL node type in n8n when you need to interact with a GraphQL API to perform data queries or manipulations. It allows you to specify various configurations such as authentication type, request method (GET or POST), endpoint, and headers. It's particularly useful when you want to query data using GraphQL's flexible query language and handle the response in your desired format (JSON or String). This node is ideal for integrating and automating workflows that involve accessing and manipulating data from GraphQL APIs."}, {"file_name": "n8n-nodes-base.comparedatasets", "summary": "You would use the Compare Datasets node type in n8n when you need to analyze and compare datasets from two different input sources. This node is applicable in scenarios where you want to identify differences, similarities, or analyze specific fields between two datasets, allowing for configuration options on how to handle discrepancies—such as selecting which dataset to prioritize or including both versions in the output. It is particularly useful in data processing tasks where understanding variations between datasets is critical, such as reconciling records, merging databases, or validating data consistency."}, {"file_name": "n8n-nodes-base.sort", "summary": "You would use the Sort node in n8n when you need to organize lists of items in a specific order or when you want to create a randomized version of a list. It provides options for simple ascending or descending sorts based on specified fields, allows disabling dot notation for accessing child fields, and enables custom JavaScript code for more complex sorting requirements."}, {"file_name": "n8n-nodes-base.removeduplicates", "summary": "You would use the Remove Duplicates node in n8n when you need to eliminate duplicate entries from your data. This is particularly useful in scenarios where users may create multiple accounts or submit identical orders, leading to redundant data. The node can address duplicates in two main ways: it can remove items that are identical within the current execution of data or those that were seen in previous executions (e.g., keeping only new or higher value records). It's ideal for maintaining clean datasets, especially when processing large amounts of information."}, {"file_name": "n8n-nodes-base.readwritefile", "summary": "You would use the Read/Write Files from Disk node in n8n when you need to directly access files on the machine where n8n is running, specifically for reading data from existing files or writing new data to files on disk. This node is particularly useful for automating workflows that involve file manipulation, such as processing, logging, or generating reports in file formats, and executing these tasks in a self-hosted n8n environment."}, {"file_name": "n8n-nodes-base.if", "summary": "You would use the If node type in n8n to conditionally split a workflow based on specified comparison operations. This is useful when you need to execute different workflow paths depending on whether certain conditions are met, such as filtering data, checking dates, or evaluating specific criteria. The If node allows for both 'AND' and 'OR' conditional logic, enabling the creation of complex workflow decisions."}, {"file_name": "n8n-nodes-base.wait", "summary": "The Wait node in n8n is used to pause a workflow's execution based on specific conditions, allowing for flexible automation. You would use this node when you need to introduce a delay in the workflow, wait for a certain time to elapse, wait until a specified date and time, resume on an HTTP webhook call, or wait for a form submission. This capability is essential for coordinating actions that depend on user inputs or timing within complex workflows."}, {"file_name": "n8n-nodes-base.crypto", "summary": "You would use the Crypto node in n8n when you need to encrypt or hash data within your workflows. This node allows you to generate random strings, compute hashes for texts or files, create HMAC signatures, and sign strings using a private key. It is useful for ensuring data security and integrity through various encryption methods."}, {"file_name": "n8n-nodes-base.html", "summary": "You would use the HTML node type in n8n when you need to automate tasks involving HTML content. This includes generating HTML templates from workflow data, extracting specific parts from HTML sources (either from JSON or binary files), and converting data into HTML tables. It is particularly useful for creating dynamic HTML outputs, scraping data from HTML pages, or formatting data nicely in table form. However, caution is advised regarding security risks such as cross-site scripting (XSS) when generating HTML from untrusted inputs."}, {"file_name": "n8n-nodes-base.markdown", "summary": "You would use the Markdown node in n8n when you need to convert text between Markdown and HTML formats. It's useful for automating workflows that involve generating HTML from Markdown, such as preparing content for a web page, or vice versa, converting HTML back to Markdown for easy editing or storage. The node provides operations for both conversions and has various configurable options to customize the output format according to your needs, such as handling links, image dimensions, and formatting styles."}, {"file_name": "n8n-nodes-base.git", "summary": "The Git node in n8n is used when you want to automate tasks related to version control using Git repositories. You would use this node to perform operations such as adding files, committing changes, cloning repositories, fetching updates from a remote repository, pulling changes, pushing commits, managing configurations, viewing commit history, and handling tags. This node is beneficial for integrating Git functionalities into workflows, enabling automated code versioning and deployment processes."}, {"file_name": "n8n-nodes-base.limit", "summary": "You would use the Limit node in n8n when you need to restrict the number of items processed in a workflow to a specific maximum count. This is useful for managing data sizes by truncating excessive items either from the start or the end of the input data set, ensuring that workflows operate efficiently and within desired limits."}, {"file_name": "n8n-nodes-base.executecommand", "summary": "You would use the Execute Command node in n8n when you need to run shell commands directly on the host machine where n8n is installed. This is particularly useful for automation tasks that require shell-level operations, such as file management or system commands. The node can execute commands either once or for every item it receives, and it is ideal for integrating shell operations into your workflows. However, it is not available on n8n Cloud."}, {"file_name": "n8n-nodes-base.itemlists", "summary": "You would use the Item Lists node when you need to manipulate returned data that contains lists or arrays. It simplifies data processing without writing custom code by allowing actions such as concatenating multiple items, limiting the number of items, removing duplicates, sorting items, splitting lists into individual items, or summarizing data similar to a pivot table. However, note that this node has been removed in version 1.21.0 of n8n, and you should use alternative nodes like Aggregate, Limit, Remove Duplicates, Sort, Split Out, and Summarize instead."}, {"file_name": "n8n-nodes-base.filter", "summary": "You would use the Filter node type in n8n when you need to selectively pass items to the next node based on specific conditions. For example, if you want to include only items that meet certain criteria (like a date being after a specified point), you can set up conditions using various data types and comparison operations. The Filter node allows for flexible combinations of conditions using AND or OR logic, facilitating precise control over the flow of your workflow."}, {"file_name": "n8n-nodes-base.editimage", "summary": "You would use the Edit Image node in n8n when you need to manipulate and modify images as part of your workflow automation. This node allows for operations such as blurring, cropping, resizing, rotating, compositing, and adding text to images. It's useful for tasks that involve adjusting image quality, preparing images for display, or creating graphics dynamically based on data inputs. Additionally, this node requires either GraphicsMagick or compatible image data handling from other nodes like Read/Write Files or HTTP Request."}, {"file_name": "n8n-nodes-base.jwt", "summary": "You would use the JWT node type in n8n when you need to work with JSON Web Tokens within your workflows. This node allows you to decode, sign, and verify JWTs, making it essential for tasks involving token-based authentication and authorization. It is particularly useful when you need to handle token claims, such as audience, expiration, issuer, JWT ID, not before, and subject. The operations include signing new tokens, decoding existing ones, or verifying their validity, which is pivotal for securing access to resources in automated processes."}, {"file_name": "n8n-nodes-base.code", "summary": "You would use the Code node in n8n when you need to execute custom JavaScript code as part of your workflow, allowing for advanced data manipulation, integration with APIs, or applying logic that is not possible with standard node functionalities. It is particularly useful for operations that require personalized processing or transformation of data."}, {"file_name": "n8n-nodes-base.form", "summary": "Use the n8n Form node to create interactive user-facing forms with multiple steps, enabling the collection and processing of user input. It is essential to pair this node with the n8n Form Trigger to initiate workflows by receiving data from users. Use this node when you need to present complex forms, incorporate custom HTML, handle hidden fields, and manage branching logic for workflows effectively."}, {"file_name": "n8n-nodes-base.ftp", "summary": "You would use the FTP node in n8n to automate the process of accessing and managing files on an FTP or SFTP server. This node allows you to perform essential file operations such as uploading, downloading, deleting, renaming, and listing files and folders on the server. It's particularly useful when integrating file management into larger workflows, especially when handling data exchanges or archiving processes that involve hosted files."}, {"file_name": "n8n-nodes-base.set", "summary": "You would use the Edit Fields (Set) node in n8n to modify or add data to the workflow data being passed through. This is particularly useful in scenarios where you need to adjust incoming data from previous nodes, such as when preparing data for insertion into applications like Google Sheets or databases. It allows for both manual field mapping through a graphical interface and the option to define fields using JSON output. Additionally, you can choose to keep only the fields you set, include binary data, and customize data structures using dot notation."}, {"file_name": "n8n-nodes-base.splitout", "summary": "You would use the Split Out node when you need to separate a list contained within a single data item into multiple individual items, such as splitting a list of customers into separate entries for each customer. This allows you to manage and process each item individually in your n8n workflow."}, {"file_name": "n8n-nodes-base.respondtowebhook", "summary": "Use the Respond to Webhook node to manage the responses to incoming webhooks in n8n workflows. It's essential when you need to control what data is returned to the requester after a webhook triggers a workflow. This node can send various types of responses, including JSON objects, binary files, or plain text, based on the incoming data. It's particularly useful after processing data with other nodes in the workflow. Moreover, it integrates directly with the Webhook node as part of a trigger-response setup, allowing for a seamless communication flow between your n8n workflows and external services."}, {"file_name": "n8n-nodes-base.noop", "summary": "You would use the No Operation, do nothing node when you want to create clarity within a workflow by visually indicating where data flow stops without performing any actions. This can enhance the readability and understanding of the workflow for others."}, {"file_name": "n8n-nodes-base.webhook", "summary": "You would use the Webhook node in n8n to create webhooks that trigger workflows in response to events from other applications and services. It's particularly useful when you want to receive data and execute workflows based on that data, especially for services lacking dedicated app triggers. Additionally, the Webhook node can function as an API endpoint, processing data and returning results, making it essential for integrating various services into automated workflows."}, {"file_name": "n8n-nodes-base.aggregate", "summary": "You would use the Aggregate node in n8n to group separate items or portions of data together into single items, either by aggregating individual fields separately or by combining all item data into a single list. This is particularly useful when you need to consolidate data from multiple entries into a more manageable format, such as when preparing data for reporting or further processing."}, {"file_name": "n8n-nodes-base.ssh", "summary": "You would use the SSH node type in n8n when you need to execute commands, download files, or upload files to a remote device using the Secure Shell Protocol. This node is particularly useful for automating tasks that involve remote server administration, file management, or executing scripts on a remote machine."}, {"file_name": "n8n-nodes-base.extractfromfile", "summary": "You would use the Extract From File node in n8n when you need to retrieve and manipulate data from various binary file formats such as CSV, JSON, HTML, PDF, XLS, and others. This node is particularly useful in workflows where files are received via HTTP requests or webhooks, allowing you to convert the data into a more manageable JSON format for further processing."}, {"file_name": "n8n-nodes-base.stopanderror", "summary": "You would use the Stop And Error node in n8n when you need to handle errors in your workflow by displaying custom error messages or causing execution failures based on certain conditions. This node allows you to send specific error information to related error workflows, helping to improve error management and diagnostics within your automation processes."}, {"file_name": "n8n-nodes-base.switch", "summary": "You would use the Switch node in n8n when you need to route a workflow based on specific conditions. It provides more flexibility than the IF node by allowing multiple output routes instead of just two. This is useful when your workflow might branch into several different paths depending on the input data, enabling complex decision-making and processing based on various comparison operations such as equality, ranges, and data types. Additionally, it allows for fallback options if no conditions are met, making it a powerful tool for managing workflows."}, {"file_name": "n8n-nodes-base.sendemail", "summary": "You would use the Send Email node in n8n when you need to automate the process of sending emails through an SMTP server as part of a workflow. This is particularly useful for notifications, confirmations, alerts, or any automated communication where you want to send messages to a specified recipient with customizable content, subject lines, and formats (text or HTML). Additionally, it allows for the inclusion of attachments and CC/BCC recipients."}, {"file_name": "n8n-nodes-base.summarize", "summary": "You would use the Summarize node in n8n when you need to aggregate and analyze input data similarly to how pivot tables function in Excel. This node is useful for calculating values such as sums, averages, and counts based on specified fields. Additionally, it allows you to split summaries by different fields, enabling you to generate detailed report-like outputs for distinct categories within your data."}, {"file_name": "n8n-nodes-base.rssfeedread", "summary": "You would use the RSS Read node type in n8n when you want to automate the process of reading and retrieving data from RSS feeds published on the internet. This node is helpful for integrating dynamic content updates from various websites into your workflows."}, {"file_name": "n8n-nodes-base.converttofile", "summary": "Use the Convert to File node in n8n when you need to transform input JSON data into different file formats (like CSV, HTML, JSON, XLSX, etc.) for easier handling, storage, or sharing. This node is particularly useful for generating reports, exporting data, or converting data into a binary form for file operations. It supports multiple output formats, allowing flexible integration in workflows."}, {"file_name": "n8n-nodes-base.debughelper", "summary": "The Debug Helper node in n8n is used primarily during the testing phase of workflow development. It allows users to simulate different scenarios by triggering specific error types or generating random datasets. This functionality is beneficial when debugging workflows, ensuring that they handle errors appropriately, or testing how workflows behave with various types of data input. Options within the node enable the user to either do nothing, throw predefined errors, simulate out-of-memory situations, or create various formats of random data, making it a versatile tool for testing and development."}, {"file_name": "n8n-nodes-base.httprequest", "summary": "You would use the HTTP Request node when you need to make HTTP requests to interact with and query data from various applications or services that provide a REST API. It's suitable for scenarios where you need to send GET, POST, PUT, DELETE, or other HTTP methods, configure query parameters, headers, and request bodies, and handle authentication for different types of APIs. This node is especially useful for integrating multiple services within n8n workflows and automating tasks that depend on external API responses."}, {"file_name": "n8n-nodes-base.aitransform", "summary": "You would use the AI Transform node type in n8n when you need to automatically generate code snippets based on specific prompts related to your workflow. It is particularly useful for processing or categorizing data in a context-aware manner, understanding the nodes and data types involved in your workflow. This node is available exclusively on Cloud plans and helps streamline the workflow automation process by creating transformation code efficiently."}, {"file_name": "n8n-nodes-base.splitinbatches", "summary": "You would use the Loop Over Items node in n8n when you need to process data in batches, particularly when working with services that have rate limits or when you want to loop until all items are processed. This node is valuable when the default behavior of processing multiple items at once isn't suitable, such as in scenarios requiring manual control over iterations or when needing to treat each incoming batch as a new set of data. It's also useful in cases like querying paginated APIs where the number of iterations is not predefined."}]