[{"file_name": "n8n-nodes-base.ssetrigger", "summary": "The SSE Trigger node is used when you need to receive real-time updates from a server via Server-Sent Events (SSE) over an HTTP connection. This node is essential in workflows where timely data updates are critical, allowing automated responses or actions based on changes or new information sent from the server."}, {"file_name": "n8n-nodes-base.scheduletrigger", "summary": "Use the Schedule Trigger node in n8n to automate workflows at fixed intervals—similar to a Cron job. It allows you to specify the timing for task execution, ranging from seconds, minutes, hours, days, weeks, to months. You would use this node type whenever you need to run a workflow periodically or at specific times, making it ideal for tasks like data polling, report generation, or regular updates."}, {"file_name": "n8n-nodes-base.n8ntrigger", "summary": "You would use the n8n Trigger node when you need to respond to specific events in your n8n workflows. It is designed to trigger actions when the current workflow is updated, activated, or when the n8n instance starts or restarts. This allows for automation and notifications based on these events, making it useful for managing workflow states and instance activity."}, {"file_name": "n8n-nodes-base.formtrigger", "summary": "You would use the n8n Form Trigger node to initiate a workflow when a user submits a form, leveraging the input data from that form. It automatically generates the web form and allows for multiple pages through the associated n8n Form node. This node is particularly useful for gathering user input in various applications, creating survey forms, or handling simple feedback mechanisms. In production, it facilitates automated responses and workflows based on the data submitted."}, {"file_name": "n8n-nodes-langchain.chattrigger", "summary": "Use the Chat Trigger node in n8n when you are developing AI workflows for chatbots and chat interfaces. It's designed to handle user interactions via chat, allowing you to either use n8n's hosted chat interface or create your own embedded chat solution. The Chat Trigger node can be configured with different authentication methods, initial messages, and session handling options. It’s crucial to know that every message sent via the chat will trigger a workflow execution, impacting your execution limits. This node is ideal for scenarios where you need an interactive chatbot experience and wish to integrate sophisticated workflows including agent or chain nodes."}, {"file_name": "n8n-nodes-base.manualworkflowtrigger", "summary": "You would use the Manual Trigger node in n8n when you want to start a workflow manually, specifically by selecting **Test Workflow**. This is useful for testing workflows without wanting them to run automatically or when you do not want any option for automatic execution. It helps in scenarios where workflows are being developed or debugged before adding automatic triggers."}, {"file_name": "n8n-nodes-base.activationtrigger", "summary": "You would use the Activation Trigger node in n8n to initiate a workflow based on certain events. It's specifically designed to trigger actions when the workflow is activated, when n8n starts or restarts, or when a currently active workflow is updated. However, it's important to note that this node has been deprecated and replaced by the n8n Trigger node and Workflow Trigger node for future workflows."}, {"file_name": "n8n-nodes-base.errortrigger", "summary": "You would use the Error Trigger node in n8n when you want to create workflows that specifically handle errors from other workflows. This node allows you to capture details about any failures in linked workflows and automatically initiate an error workflow to manage those errors. It is particularly useful for automating error responses without needing to activate the workflow, as it runs whenever a linked workflow encounters an error."}, {"file_name": "n8n-nodes-base.workflowtrigger", "summary": "The Workflow Trigger node in n8n is used to initiate a workflow when certain events occur related to that workflow, specifically when the workflow is updated or activated. This node allows users to set up triggers for notifications about the workflow's status. However, it is important to note that the Workflow Trigger node has been deprecated and its functionality has been transitioned to the n8n Trigger node."}, {"file_name": "n8n-nodes-base.rssfeedreadtrigger", "summary": "You would use the RSS Feed Trigger node when you want to initiate an n8n workflow in response to new items published in an RSS feed. This node is useful for automating tasks based on RSS updates, allowing for timely actions such as notifications or data processing whenever new content becomes available from a specified feed URL."}, {"file_name": "n8n-nodes-base.localfiletrigger", "summary": "You would use the Local File Trigger node in n8n when you want to initiate a workflow based on specific changes in your file system, such as when a file or folder is added, modified, or deleted. This node is particularly useful for automating tasks in response to file system events, and it is applicable in self-hosted environments since it is not available on n8n Cloud. You can customize the watch criteria based on specific files or folders and set exclusions or depth limits for monitoring."}, {"file_name": "n8n-nodes-base.executeworkflowtrigger", "summary": "You would use the Execute Sub-workflow Trigger node when you want to start a workflow in response to another workflow. This is particularly useful for reusing workflows, such as having several workflows that process data which then call a single workflow to generate a report, or for breaking large workflows into smaller, more manageable components."}, {"file_name": "n8n-nodes-base.emeliatrigger", "summary": "You would use the Emelia Trigger node in n8n when you want to automate workflows related to cold-emailing campaigns. It allows you to respond to various events from the Emelia tool, such as tracking when an email is bounced, opened, replied to, sent, a link is clicked, or if a contact has unsubscribed. This integration is useful for optimizing email strategies and managing responses effectively."}, {"file_name": "n8n-nodes-base.whatsapptrigger", "summary": "You would use the WhatsApp Trigger node in n8n when you need to respond to specific events occurring in WhatsApp, such as account updates, message receptions, or quality updates. This node enables integration between WhatsApp and other applications, allowing for automation of workflows based on WhatsApp events."}, {"file_name": "n8n-nodes-base.microsoftoutlooktrigger", "summary": "You would use the Microsoft Outlook Trigger node when you want to automate workflows based on specific events occurring in Microsoft Outlook, such as receiving a new message. This integration allows you to connect Microsoft Outlook with other applications and automate tasks triggered by Outlook events, providing a seamless way to enhance productivity and communication management."}, {"file_name": "n8n-nodes-base.customeriotrigger", "summary": "You would use the Customer.io Trigger node in n8n when you want to automate workflows that respond to events in Customer.io, such as sending targeted communications (emails, push notifications, SMS) based on customer segments or website interactions. This node is useful for integrating customer engagement strategies within automated processes to improve customer retention and drive subscriptions."}, {"file_name": "n8n-nodes-base.activecampaigntrigger", "summary": "You would use the ActiveCampaign Trigger node in n8n to automate workflows that respond to specific events in ActiveCampaign, such as changes in contacts, deals, or campaigns. This node is particularly useful for integrating ActiveCampaign's customer experience automation features into your n8n workflows, allowing for seamless trigger-based automation in various business scenarios."}, {"file_name": "n8n-nodes-base.calendlytrigger", "summary": "You would use the Calendly Trigger node in n8n to automate workflows that are triggered by activities in Calendly, such as when a meeting is scheduled. This node simplifies the process of integrating Calendly's scheduling functionalities into various automated workflows."}, {"file_name": "n8n-nodes-base.googlebusinessprofiletrigger", "summary": "The Google Business Profile Trigger node is used when you want to automate responses to specific events occurring in Google Business Profile, such as receiving new reviews. This node integrates seamlessly with other applications through n8n workflows, allowing you to react to customer feedback and enhance engagement with your business profile."}, {"file_name": "n8n-nodes-base.thehive5trigger", "summary": "You would use the TheHive 5 Trigger node when you want to automate workflows that respond to specific events occurring in TheHive, such as the creation, updating, or deletion of alerts, cases, comments, observables, pages, and tasks. This node is particularly useful for integrating TheHive with other applications via event-driven actions and for leveraging TheHive's version 5 API."}, {"file_name": "n8n-nodes-base.trellotrigger", "summary": "You would use the Trello Trigger node in n8n when you want to automate workflows that respond to events in Trello, such as changes to task boards, lists, or cards. This node is particularly useful for integrating Trello into larger workflows, allowing you to react to actions taken within Trello in real-time."}, {"file_name": "n8n-nodes-base.webflowtrigger", "summary": "You would use the Webflow Trigger node in n8n to automate workflows that respond to events occurring in Webflow, such as when content is published or updated on a website created using Webflow. This node enables seamless integration with Webflow, allowing users to trigger actions in their n8n workflows based on Webflow interactions."}, {"file_name": "n8n-nodes-base.kobotoolboxtrigger", "summary": "You would use the KoboToolbox Trigger node type in n8n to automatically initiate workflows in response to new form submissions from KoboToolbox. This node simplifies integration by managing the webhook setup for you, allowing for seamless automation of data collection without manual intervention in KoboToolbox."}, {"file_name": "n8n-nodes-base.pushcuttrigger", "summary": "You would use the Pushcut Trigger node when you want to integrate Pushcut notifications with your automated workflows in n8n. This node allows you to respond to smart notifications from the Pushcut app, enabling you to initiate actions and automations based on user-defined notifications on iOS."}, {"file_name": "n8n-nodes-base.woocommercetrigger", "summary": "You would use the WooCommerce Trigger node when you want to automate workflows in response to specific events occurring in a WooCommerce store, such as the creation, updating, or deletion of coupons, customers, orders, or products. This node is particularly useful for synchronizing e-commerce data with other applications or for triggering actions based on customer interactions."}, {"file_name": "n8n-nodes-base.kafkatrigger", "summary": "You would use the Kafka Trigger node type in n8n when you want to integrate with Apache Kafka to receive real-time data streams, trigger workflows based on specific events in Kafka topics, and handle high-performance data pipelines and streaming analytics."}, {"file_name": "n8n-nodes-base.affinitytrigger", "summary": "You would use the Affinity Trigger node in n8n when you want to leverage relationship intelligence from the Affinity platform to automate workflows related to closing deals and managing connections in your network."}, {"file_name": "n8n-nodes-base.surveymonkeytrigger", "summary": "You would use the SurveyMonkey Trigger node when you want to automate workflows in response to survey events from the SurveyMonkey platform, such as receiving new survey responses or updates. This enables integration with other applications and processes within n8n, leveraging real-time survey data."}, {"file_name": "n8n-nodes-base.gitlabtrigger", "summary": "You would use the GitLab Trigger node in n8n when you want to automate workflows in response to events occurring in GitLab, such as pushes to repositories, issue updates, or merge requests. This node allows you to integrate GitLab's features into your automated processes, making it easier to manage DevOps tasks."}, {"file_name": "n8n-nodes-base.clickuptrigger", "summary": "You would use the ClickUp Trigger node when you need to automate workflows by responding to events occurring in ClickUp, such as task updates or new task assignments. This integration is beneficial for businesses looking to streamline their project management processes and improve team collaboration by triggering actions in n8n based on specific activities in ClickUp."}, {"file_name": "n8n-nodes-base.lemlisttrigger", "summary": "You would use the Lemlist Trigger node in n8n to automate workflows based on various events from the Lemlist email outreach platform. This node allows you to trigger actions in response to specific occurrences like emails being sent, opened, clicked, or when there are updates regarding contacts and LinkedIn interactions. It is particularly useful for integrating automated outreach processes into your larger workflow, ensuring real-time responses to user engagement without manual intervention."}, {"file_name": "n8n-nodes-base.gmailtrigger", "summary": "You would use the Gmail Trigger node in n8n when you want to initiate workflows based on specific events in Gmail, specifically when new messages are received. This allows for automation of processes that respond to emails, enabling actions like organizing emails, notifying users, or triggering other workflows based on the content or sender of the received emails."}, {"file_name": "n8n-nodes-base.googlecalendartrigger", "summary": "You would use the Google Calendar Trigger node in n8n when you want to automate workflows based on specific events occurring in Google Calendar, such as when an event is created, updated, cancelled, started, or ended. This node is useful for integrating Google Calendar's scheduling capabilities into various automated processes."}, {"file_name": "n8n-nodes-base.helpscouttrigger", "summary": "You would use the Help Scout Trigger node in n8n when you want to automate workflows based on events occurring in Help Scout, such as receiving a new customer support ticket or message. This node allows you to integrate Help Scout's features, like email-based customer support, into your automation processes, enabling seamless communication and task management within your support system."}, {"file_name": "n8n-nodes-base.gumroadtrigger", "summary": "You would use the Gumroad Trigger node when you need to automate workflows in response to specific events occurring on the Gumroad platform, such as when a sale is made or a product is updated. This integration allows creators to streamline their operations and trigger other actions in their n8n workflows based on customer interactions within their Gumroad store."}, {"file_name": "n8n-nodes-base.flowtrigger", "summary": "You would use the Flow Trigger node when integrating n8n workflows with Flow, a modern task and project management software. This node is suitable for scenarios where you want to automate processes involving tasks, projects, timelines, and conversations within the Flow platform, leveraging its capabilities alongside other tools."}, {"file_name": "n8n-nodes-base.autopilottrigger", "summary": "You would use the Autopilot Trigger node in n8n when you want to automate workflows that respond to specific events in Autopilot, such as when a contact is added or updated, added to or removed from a list, enters or leaves a segment, or unsubscribes. This node is ideal for integrating marketing automation processes into your n8n workflows, allowing you to personalize and automate your marketing efforts across the customer journey."}, {"file_name": "n8n-nodes-base.microsoftonedrivetrigger", "summary": "You would use the Microsoft OneDrive Trigger node in n8n when you want to automate workflows based on specific events occurring in Microsoft OneDrive, such as files or folders being created or updated. This node connects OneDrive with other applications, allowing you to respond to changes in your OneDrive account."}, {"file_name": "n8n-nodes-base.airtabletrigger", "summary": "The Airtable Trigger node is used when you want to automate workflows in response to changes in an Airtable base or table. Specifically, it allows you to listen for events, such as new records being created or modified, making it advantageous for integration scenarios where updates in Airtable need to trigger subsequent actions in other applications or systems. This node is particularly useful for users who rely on Airtable's database features integrated into automated processes, helping them streamline operations based on changes in their Airtable data."}, {"file_name": "n8n-nodes-base.onfleettrigger", "summary": "You would use the Onfleet Trigger node when you want to create workflows that respond to specific events in the Onfleet logistics platform. This includes handling scenarios such as task assignments, completions, failures, or updates, as well as managing worker-related events like creation and deletion. It is particularly useful for automating processes in last-mile delivery, allowing seamless integration with the Onfleet service."}, {"file_name": "n8n-nodes-base.boxtrigger", "summary": "You would use the Box Trigger node in n8n to automate workflows based on events occurring in Box, such as file uploads or changes to a specific folder. This node allows you to integrate Box's file sharing and collaboration features into your automation processes, enabling you to respond to actions in Box seamlessly."}, {"file_name": "n8n-nodes-base.caltrigger", "summary": "You would use the Cal Trigger node type in n8n to automate workflows that involve scheduling and managing meetings through the Cal platform. It is particularly useful for users looking to streamline their event management processes by integrating scheduling capabilities directly into their automated tasks."}, {"file_name": "n8n-nodes-base.notiontrigger", "summary": "You would use the Notion Trigger node when you need to automate workflows based on specific events in Notion, such as when a page is added to a database or when a page is updated in a database. This integration allows you to connect Notion with other applications, enhancing productivity and streamlining operations."}, {"file_name": "n8n-nodes-base.crowddevtrigger", "summary": "You would use the crowd.dev Trigger node in n8n to automate workflows that respond to specific events occurring within the crowd.dev platform, such as when a new activity is recorded or when a new member joins. This enables integration of crowd.dev with other applications, allowing users to streamline processes based on these events."}, {"file_name": "n8n-nodes-base.mqtttrigger", "summary": "You would use the MQTT Trigger node in n8n when you want to integrate and automate workflows that respond to messages published on MQTT topics. This is useful for connecting and communicating between IoT devices or applications that utilize the MQTT protocol, enabling real-time data processing based on incoming messages."}, {"file_name": "n8n-nodes-base.clockifytrigger", "summary": "You would use the Clockify Trigger node in n8n when you want to automate workflows based on time tracking events from the Clockify app, such as when new time entries are created. It helps integrate Clockify's time tracking capabilities into your n8n workflows, enabling you to respond to changes in time entries with subsequent actions in your automation processes."}, {"file_name": "n8n-nodes-base.mailjettrigger", "summary": "You would use the Mailjet Trigger node when you want to automate workflows based on events related to email interactions, such as when a user interacts with marketing or transactional emails sent through Mailjet. This node integrates with Mailjet, a platform for sending and tracking emails, allowing you to react to email events in your n8n workflows."}, {"file_name": "n8n-nodes-base.pipedrivetrigger", "summary": "You would use the Pipedrive Trigger node in n8n when you want to automate workflows that respond to events occurring in Pipedrive, a cloud-based sales software. This node allows you to integrate Pipedrive with other applications and streamline processes such as lead management, sales tracking, and customer follow-ups."}, {"file_name": "n8n-nodes-base.facebookleadadstrigger", "summary": "You would use the Facebook Lead Ads Trigger node in n8n when you want to automate responses to new leads generated from Facebook Lead Ads. This node enables you to integrate the data collected from these leads with other applications and services, making it useful for workflows involving lead management, marketing follow-ups, and enhanced customer engagement. It is particularly beneficial for businesses that rely on Facebook advertising to drive leads and want to streamline their processes by automatically responding to lead submissions."}, {"file_name": "n8n-nodes-base.mautictrigger", "summary": "You would use the Mautic Trigger node when you need to integrate Mautic's marketing automation capabilities into your workflows within n8n. This node allows for the automation of tasks related to lead generation, contact management, and campaign execution, providing triggers based on events in Mautic."}, {"file_name": "n8n-nodes-base.stripetrigger", "summary": "You would use the Stripe Trigger node in n8n when you want to automate workflows based on events from Stripe's payment APIs. This node allows you to respond to specific triggers such as payments, subscriptions, or charges, enabling the integration of Stripe's services into your automations seamlessly. Its functionality is ideal for online businesses that need to handle payment-related events effortlessly."}, {"file_name": "n8n-nodes-base.convertkittrigger", "summary": "You would use the ConvertKit Trigger node when you want to automate workflows that are triggered by events in ConvertKit, such as subscriber actions or new email campaigns. This node is ideal for integrating ConvertKit with other services in your workflow, allowing you to respond in real-time to changes in your email marketing activities."}, {"file_name": "n8n-nodes-base.rabbitmqtrigger", "summary": "You would use the RabbitMQ Trigger node in n8n when you want to react to messages being published on a RabbitMQ message queue. This is useful for workflows that require real-time processing of events or data as they arrive via RabbitMQ, allowing you to automate tasks based on these incoming messages."}, {"file_name": "n8n-nodes-base.ciscowebextrigger", "summary": "You would use the Webex by Cisco Trigger node in n8n when you want to integrate and automate workflows based on events occurring within the Webex platform, such as when a meeting starts or when participants join. This node helps create triggers for specific actions in your Webex account, allowing for seamless interaction with other applications and services in your n8n workflows."}, {"file_name": "n8n-nodes-base.brevotrigger", "summary": "You would use the Brevo Trigger node in n8n when you need to integrate Brevo's digital marketing platform into your workflow. This node allows for automation in response to events from Brevo, helping to streamline marketing processes and enhance business growth."}, {"file_name": "n8n-nodes-base.lonescaletrigger", "summary": "You would use the LoneScale Trigger node to respond to specific events occurring in LoneScale, enabling you to integrate these events with other applications in your workflows. This node is beneficial for automating processes that rely on real-time data or activities generated within the LoneScale platform."}, {"file_name": "n8n-nodes-base.zendesktrigger", "summary": "You would use the Zendesk Trigger node when you want to automate workflows involving customer support interactions managed through Zendesk. This node allows you to trigger actions based on events occurring in Zendesk, such as the creation or update of support tickets. It is particularly useful for businesses that rely on timely responses to customer inquiries and need to integrate these interactions into broader automated workflows."}, {"file_name": "n8n-nodes-base.awssnstrigger", "summary": "You would use the AWS SNS Trigger node in n8n when you need to integrate Amazon's Simple Notification Service (SNS) into your workflows for mass message delivery, particularly useful for notifying mobile users."}, {"file_name": "n8n-nodes-base.jotformtrigger", "summary": "You would use the JotForm Trigger node in n8n to automatically initiate workflows based on form submissions created with JotForm. This node is ideal for integrating online form responses into automated processes, enabling real-time data handling and actions based on user interactions with the forms."}, {"file_name": "n8n-nodes-base.shopifytrigger", "summary": "You would use the Shopify Trigger node in n8n when you want to automate workflows that respond to specific events occurring in your Shopify store, such as new orders or customer updates. This node enables you to integrate Shopify with other services and tools, facilitating triggers based on e-commerce activities."}, {"file_name": "n8n-nodes-base.postgrestrigger", "summary": "You would use the Postgres Trigger node in n8n when you want to respond to real-time events occurring in a Postgres database, such as insertions, updates, or deletions. This allows for seamless integration of Postgres with other applications in your workflows, enabling automated responses to database changes."}, {"file_name": "n8n-nodes-base.wufootrigger", "summary": "You would use the Wufoo Trigger node when you want to automatically respond to events or submissions from custom HTML forms created using Wufoo. This node integrates Wufoo with your workflows in n8n, allowing you to trigger actions based on form submissions without needing to write code."}, {"file_name": "n8n-nodes-base.eventbritetrigger", "summary": "You would use the Eventbrite Trigger node in n8n when you want to automate workflows based on events created or managed through Eventbrite. This node allows you to respond to triggers from the Eventbrite platform, making it useful for applications such as managing event registrations, sending notifications, or integrating event data into other services."}, {"file_name": "n8n-nodes-base.thehivetrigger", "summary": "You would use the TheHive Trigger node in n8n when you want to automate workflows in response to specific events from TheHive's version 3 or 4 API. This node can trigger actions based on various events such as Alerts, Cases, Logs, Observables, and Tasks being created, updated, or deleted. It is particularly useful for incident response and security operations automation, enabling real-time data handling as incidents evolve."}, {"file_name": "n8n-nodes-base.jiratrigger", "summary": "You would use the Jira Trigger node in n8n when you want to automate actions in response to changes in Jira, such as updates to issues or project management tasks. This node allows your workflows to react to events in Jira, enhancing your project management and bug tracking processes."}, {"file_name": "n8n-nodes-base.formiotrigger", "summary": "Use the Form.io Trigger node when you need to integrate Form.io as a data source in your n8n workflows, allowing you to automate processes based on form submissions or API data from Form.io."}, {"file_name": "n8n-nodes-base.coppertrigger", "summary": "You would use the Copper Trigger node when you want to integrate and automate tasks involving Copper, a CRM that is well-suited for small and medium-sized businesses, particularly those that utilize Google Workspace. This node allows you to create workflows that respond to events in Copper, enhancing your productivity through seamless integration."}, {"file_name": "n8n-nodes-base.lineartrigger", "summary": "You would use the Linear Trigger node in n8n when you want to automate workflows based on events in the Linear issue tracking tool. This node allows you to respond to specific events such as comments, cycles, issues, issue comments, issue labels, and projects, making it a useful tool for integrating issue tracking into your automated processes."}, {"file_name": "n8n-nodes-base.salesforcetrigger", "summary": "You would use the Salesforce Trigger node when you want to automate workflows that respond to specific events occurring in Salesforce, such as the creation or update of accounts, contacts, opportunities, or other Salesforce entities. This node allows integration of Salesforce with other applications by triggering processes based on the specified events."}, {"file_name": "n8n-nodes-base.mailchimptrigger", "summary": "You would use the Mailchimp Trigger node when you want to automate workflows that respond to specific events in Mailchimp, such as new subscribers or engagement activities. This integration allows you to seamlessly track and react to user interactions within your email marketing campaigns."}, {"file_name": "n8n-nodes-base.hubspottrigger", "summary": "You would use the HubSpot Trigger node when you want to automate workflows based on specific events occurring in HubSpot, such as the creation or deletion of companies, contacts, deals, tickets, or conversations. This node enables you to listen for real-time changes and trigger subsequent actions in your n8n workflows, thereby enhancing your integration with HubSpot's marketing and customer support tools."}, {"file_name": "n8n-nodes-base.chargebeetrigger", "summary": "You would use the Chargebee Trigger node when you want to automate workflows that respond to events from the Chargebee billing platform. This is especially useful for subscription-based SaaS and eCommerce businesses that utilize Chargebee for managing recurring payments, invoicing, and customer interactions. It allows you to trigger actions in your workflows based on specific events occurring in Chargebee."}, {"file_name": "n8n-nodes-base.wisetrigger", "summary": "You would use the Wise Trigger node in n8n when you need to automate workflows based on specific events in your Wise account, such as receiving money, transfers being credited or debited, or changes in transfer statuses. This node is particularly useful for monitoring financial transactions and integrating them into broader workflows with minimal manual intervention."}, {"file_name": "n8n-nodes-base.stravatrigger", "summary": "You would use the Strava Trigger node when you want to automate workflows based on events from the Strava platform, such as changes to activities or athlete profiles. This node allows you to react to events like creating, updating, or deleting activities or athletes, making it useful for integrating fitness tracking data into your applications or workflows."}, {"file_name": "n8n-nodes-base.invoiceninjatrigger", "summary": "You would use the Invoice Ninja Trigger node in n8n to automate workflows that respond to events from Invoice Ninja, such as new invoices, payments, or updates. This node is beneficial for freelancers and businesses that require seamless integration of invoicing and payment processes into their automations."}, {"file_name": "n8n-nodes-base.figmatrigger", "summary": "You would use the Figma Trigger node in n8n when you want to automate workflows based on specific events occurring in Figma files. This node is useful for teams on the Professional Figma plan, allowing them to trigger actions in response to comments, file updates, deletions, version updates, or library publications."}, {"file_name": "n8n-nodes-base.netlifytrigger", "summary": "You would use the Netlify Trigger node when you want to integrate your workflows with Netlify's hosting and serverless backend services, allowing you to react to events from your Netlify applications or static websites."}, {"file_name": "n8n-nodes-base.twiliotrigger", "summary": "You would use the Twilio Trigger node in n8n to automate workflows that respond to events from Twilio, such as when a new SMS is received or a call is made. This integration allows for seamless interaction between Twilio and other applications, enabling event-driven actions in your processes."}, {"file_name": "n8n-nodes-base.taigatrigger", "summary": "You would use the Taiga Trigger node type in n8n to integrate the Taiga project management platform into your automation workflows. This node allows you to respond to events and updates from Taiga, making it ideal for automating tasks related to project management, agile development, or team collaboration."}, {"file_name": "n8n-nodes-base.slacktrigger", "summary": "You would use the Slack Trigger node when you want to respond to specific events occurring in Slack and integrate those responses with other applications in your workflows. This node allows you to react to events such as new messages, user mentions, file sharing, or the creation of new channels directly from Slack, enabling automation and enhanced workflow management."}, {"file_name": "n8n-nodes-base.telegramtrigger", "summary": "You would use the Telegram Trigger node when you want to automate workflows based on events happening in Telegram, such as new messages, callback queries, chat member updates, or reactions. This node is critical for handling real-time interactions with users or a business account on Telegram, making it ideal for chatbots, customer engagement, and automated messaging responses within Telegram's platform."}, {"file_name": "n8n-nodes-base.mailerlitetrigger", "summary": "You would use the MailerLite Trigger node when you want to automate workflows based on specific events related to email marketing activities, such as when a campaign is sent or when subscribers are added or updated. This node allows your workflows in n8n to respond to various triggers from MailerLite, enhancing the automation of email marketing processes."}, {"file_name": "n8n-nodes-base.postmarktrigger", "summary": "You would use the Postmark Trigger node in n8n when you want to integrate and automate workflows based on events from Postmark, such as tracking email delivery, opens, bounces, and spam complaints. This node is beneficial for monitoring email communication metrics and triggering actions in response to email events."}, {"file_name": "n8n-nodes-base.facebooktrigger", "summary": "You would use the Facebook Trigger node to automate workflows in response to specific events occurring on Facebook, such as updates in ad accounts, application changes, group activities, or user profile modifications. This node is ideal for integrating Facebook notifications into broader automated processes seamlessly. It can help monitor engagement on your Facebook assets and facilitate timely reactions without manual intervention."}, {"file_name": "n8n-nodes-base.seatabletrigger", "summary": "You would use the SeaTable Trigger node in n8n when you want to automate workflows that need to respond to changes in a SeaTable database. This node allows for integrations that trigger actions in n8n in response to events occurring in the SeaTable application, making it ideal for collaborative database scenarios."}, {"file_name": "n8n-nodes-base.acuityschedulingtrigger", "summary": "You would use the Acuity Scheduling Trigger node in n8n when you need to automate workflows based on appointments scheduled through Acuity Scheduling. This node allows you to integrate real-time appointment scheduling events into your automated workflows, enabling notifications, reminders, and other actions based on calendar updates in Acuity."}, {"file_name": "n8n-nodes-base.redistrigger", "summary": "You would use the Redis Trigger node to initiate workflows in n8n whenever a new message is published to a specified Redis channel. This is useful for real-time applications where immediate responses to events or messages in Redis are required, such as processing tasks, updates, or notifications."}, {"file_name": "n8n-nodes-base.formstacktrigger", "summary": "You would use the Formstack Trigger node in n8n when you need to automate workflows based on form submissions or changes in Formstack. This node allows you to easily integrate Formstack's functionality into your automation processes, enhancing productivity by responding to user inputs or events captured through Formstack's platform."}, {"file_name": "n8n-nodes-base.keaptrigger", "summary": "You would use the Keap Trigger node in n8n when you want to automate workflows that involve monitoring events or changes in your Keap account, which is essential for managing sales, marketing automation, and customer relationship tasks for small businesses. This node allows you to react to specific triggers from Keap to streamline processes like lead capture and customer engagement."}, {"file_name": "n8n-nodes-base.githubtrigger", "summary": "You would use the GitHub Trigger node when you want to automate workflows that respond to events occurring in a GitHub repository, such as new commits, pull requests, or issues. It allows seamless integration of GitHub events into your automated processes within n8n."}, {"file_name": "n8n-nodes-base.googlesheetstrigger", "summary": "You would use the Google Sheets Trigger node in n8n when you need to automate workflows based on changes in a Google Sheets document. This node allows you to respond to specific events such as when a row is added, updated, or both added and updated. It's ideal for integrating real-time data from Google Sheets into larger automated processes, making it useful for triggering other actions in your workflows based on spreadsheet activities."}, {"file_name": "n8n-nodes-base.googledrivetrigger", "summary": "You would use the Google Drive Trigger node when you need to automate workflows based on changes or events in Google Drive, such as file creation or modification. It enables your workflows to react to specific events in real-time, facilitating synchronization and task automation related to file management in Google Drive."}, {"file_name": "n8n-nodes-base.workabletrigger", "summary": "You would use the Workable Trigger node in n8n when you want to automate workflows that respond to specific events in the Workable recruiting platform, such as when a candidate is created or moved within the system. This node enables integration of Workable with other applications, facilitating real-time updates and actions based on these events."}, {"file_name": "n8n-nodes-base.amqptrigger", "summary": "You would use the AMQP Trigger node in n8n when you want to initiate workflows based on messages received from an AMQP 1.0 compatible message broker. This node is useful for integrating message-oriented middleware into your automation processes, allowing for reliable and secure message handling, as well as queuing and routing capabilities."}, {"file_name": "n8n-nodes-base.toggltrigger", "summary": "You would use the Toggl Trigger node when you want to integrate Toggl's time tracking capabilities into your n8n workflows. This node allows you to automate actions based on time tracking events from Toggl, enhancing workflow automation by responding to time entry changes or updates."}, {"file_name": "n8n-nodes-base.typeformtrigger", "summary": "You would use the Typeform Trigger node in n8n when you want to initiate workflows based on submissions from Typeform forms and surveys. This node allows you to capture real-time responses from Typeform, which can then trigger various automated actions or processes within your n8n workflows."}, {"file_name": "n8n-nodes-base.getresponsetrigger", "summary": "You would use the GetResponse Trigger node when you want to receive real-time notifications about specific events related to your email marketing campaigns on GetResponse, such as when a customer subscribes or unsubscribes from a list, opens an email, clicks on a link, or submits a survey. This node helps automate workflows and trigger actions based on these events."}, {"file_name": "n8n-nodes-base.bitbuckettrigger", "summary": "You would use the Bitbucket Trigger node in n8n when you want to automate workflows based on events occurring in your Bitbucket repositories. This node allows you to integrate and respond to various pipeline or repository-related triggers, enabling seamless interaction with Bitbucket in your automation processes."}, {"file_name": "n8n-nodes-base.venafitlsprotectcloudtrigger", "summary": "You would use the Venafi TLS Protect Cloud Trigger node when you need to initiate an n8n workflow in response to specific events occurring in the cloud-based Venafi TLS Protect service, which is used for managing and protecting machine identities."}, {"file_name": "n8n-nodes-base.asanatrigger", "summary": "You would use the Asana Trigger node in n8n when you want to automate workflows that are initiated by specific events occurring in Asana, such as the creation or updating of tasks. This node facilitates the integration of Asana's task management capabilities into your automated processes, helping teams to efficiently track and manage their work."}, {"file_name": "n8n-nodes-base.paypaltrigger", "summary": "You would use the PayPal Trigger node when you need to integrate PayPal payment services into your workflows within n8n, allowing you to automate actions based on events such as payments or transactions occurring in PayPal."}]